; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.anon.3 = type { ptr, ptr, ptr, ptr }
%struct.anon.6 = type { ptr, ptr, ptr }
%struct.bpf_config = type { i64, i64, i8, i8, i8, i8, i32 }
%struct.pping_config = type { %struct.bpf_config, %struct.bpf_tc_opts, %struct.bpf_tc_opts, i64, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i32, i32, [16 x i8], i32, i8, i8 }
%struct.bpf_tc_opts = type { i64, i32, i32, i32, i32, i32 }
%struct.timespec = type { i64, i64 }
%struct.rtt_event = type { i64, i64, %struct.network_tuple, i32, i64, i64, i64, i64, i64, i64, i8, [7 x i8] }
%struct.network_tuple = type { %struct.flow_address, %struct.flow_address, i16, i8, i8 }
%struct.flow_address = type { %struct.in6_addr, i16, i16 }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.flow_event = type { i64, i64, %struct.network_tuple, i8, i8, i8, i8 }
%struct.map_cleanup_args = type { i64, i32, i32 }
%struct.bpf_tc_hook = type { i64, i32, i32, i32 }
%struct.map_full_event = type { i64, i64, %struct.network_tuple, i8, [3 x i8] }
%struct.flow_state = type { i64, i64, i64, i64, i64, i64, i64, i32, i8, i8, i16 }
%struct.parsing_context = type { ptr, ptr, %struct.hdr_cursor, i32, i32, i8 }
%struct.hdr_cursor = type { ptr }

!72 = !DIEnumerator(name: "BPF_TC_INGRESS", value: 1)
!73 = !DIEnumerator(name: "BPF_TC_EGRESS", value: 2)
!74 = !DIEnumerator(name: "BPF_TC_CUSTOM", value: 4)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rlimit_resource", file: !76, line: 31, baseType: !39, size: 32, elements: !77)
!76 = !DIFile(filename: "/usr/include/bits/resource.h", directory: "", checksumkind: CSK_MD5, checksum: "bb0bdc9e7ae341ef435e98e05276a863")
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!78 = !DIEnumerator(name: "RLIMIT_CPU", value: 0)
!79 = !DIEnumerator(name: "RLIMIT_FSIZE", value: 1)
!80 = !DIEnumerator(name: "RLIMIT_DATA", value: 2)
!81 = !DIEnumerator(name: "RLIMIT_STACK", value: 3)
!82 = !DIEnumerator(name: "RLIMIT_CORE", value: 4)
!83 = !DIEnumerator(name: "__RLIMIT_RSS", value: 5)
!84 = !DIEnumerator(name: "RLIMIT_NOFILE", value: 7)
!85 = !DIEnumerator(name: "__RLIMIT_OFILE", value: 7)
!86 = !DIEnumerator(name: "RLIMIT_AS", value: 9)
!87 = !DIEnumerator(name: "__RLIMIT_NPROC", value: 6)
!88 = !DIEnumerator(name: "__RLIMIT_MEMLOCK", value: 8)
!89 = !DIEnumerator(name: "__RLIMIT_LOCKS", value: 10)
!90 = !DIEnumerator(name: "__RLIMIT_SIGPENDING", value: 11)
!91 = !DIEnumerator(name: "__RLIMIT_MSGQUEUE", value: 12)
!92 = !DIEnumerator(name: "__RLIMIT_NICE", value: 13)
!93 = !DIEnumerator(name: "__RLIMIT_RTPRIO", value: 14)
!94 = !DIEnumerator(name: "__RLIMIT_RTTIME", value: 15)
!95 = !DIEnumerator(name: "__RLIMIT_NLIMITS", value: 16)
!96 = !DIEnumerator(name: "__RLIM_NLIMITS", value: 16)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 40, baseType: !39, size: 32, elements: !99)
!98 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!100 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!101 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!102 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!103 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!104 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!105 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!106 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!107 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!108 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!109 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!110 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!111 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!112 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!113 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!114 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!115 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!116 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!117 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!118 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!119 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!120 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!121 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!122 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!123 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!124 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!125 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!126 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!127 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 103, baseType: !39, size: 32, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135, !136}
!130 = !DIEnumerator(name: "IPPROTO_HOPOPTS", value: 0)
!131 = !DIEnumerator(name: "IPPROTO_ROUTING", value: 43)
!132 = !DIEnumerator(name: "IPPROTO_FRAGMENT", value: 44)
!133 = !DIEnumerator(name: "IPPROTO_ICMPV6", value: 58)
!134 = !DIEnumerator(name: "IPPROTO_NONE", value: 59)
!135 = !DIEnumerator(name: "IPPROTO_DSTOPTS", value: 60)
!136 = !DIEnumerator(name: "IPPROTO_MH", value: 135)
!137 = !{!138, !141, !142, !143, !146, !148, !149}
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__rlim_t", file: !139, line: 157, baseType: !140)
!139 = !DIFile(filename: "/usr/include/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!140 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixpoint64", file: !45, line: 9, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !144, line: 31, baseType: !145)
!144 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!145 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !139, line: 40, baseType: !147)
!147 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "pping_event", file: !45, line: 154, size: 960, elements: !151)
!151 = !{!152, !153, !208, !218}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !150, file: !45, line: 155, baseType: !143, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "rtt_event", scope: !150, file: !45, line: 156, baseType: !154, size: 960)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtt_event", file: !45, line: 114, size: 960, elements: !155)
!155 = !{!156, !157, !158, !194, !196, !197, !198, !199, !200, !201, !202, !204}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !154, file: !45, line: 115, baseType: !143, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !154, file: !45, line: 116, baseType: !143, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !154, file: !45, line: 117, baseType: !159, size: 352, offset: 128)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "network_tuple", file: !45, line: 74, size: 352, elements: !160)
!160 = !{!161, !189, !190, !191, !193}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !159, file: !45, line: 75, baseType: !162, size: 160)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_address", file: !45, line: 61, size: 160, elements: !163)
!163 = !{!164, !186, !188}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !162, file: !45, line: 62, baseType: !165, size: 128)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !98, line: 219, size: 128, elements: !166)
!166 = !{!167}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !165, file: !98, line: 226, baseType: !168, size: 128)
!168 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !165, file: !98, line: 221, size: 128, elements: !169)
!169 = !{!170, !177, !182}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !168, file: !98, line: 223, baseType: !171, size: 128)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 128, elements: !175)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !173, line: 24, baseType: !174)
!173 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !139, line: 38, baseType: !46)
!175 = !{!176}
!176 = !DISubrange(count: 16)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !168, file: !98, line: 224, baseType: !178, size: 128)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 128, elements: !180)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !173, line: 25, baseType: !146)
!180 = !{!181}
!181 = !DISubrange(count: 8)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !168, file: !98, line: 225, baseType: !183, size: 128)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 128, elements: !10)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !173, line: 26, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !139, line: 42, baseType: !39)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !162, file: !45, line: 63, baseType: !187, size: 16, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !144, line: 24, baseType: !147)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !162, file: !45, line: 64, baseType: !187, size: 16, offset: 144)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !159, file: !45, line: 76, baseType: !162, size: 160, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !159, file: !45, line: 77, baseType: !187, size: 16, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ipv", scope: !159, file: !45, line: 78, baseType: !192, size: 8, offset: 336)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !144, line: 21, baseType: !46)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !159, file: !45, line: 79, baseType: !192, size: 8, offset: 344)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !154, file: !45, line: 118, baseType: !195, size: 32, offset: 480)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !144, line: 27, baseType: !39)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "rtt", scope: !154, file: !45, line: 119, baseType: !143, size: 64, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "min_rtt", scope: !154, file: !45, line: 120, baseType: !143, size: 64, offset: 576)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sent_pkts", scope: !154, file: !45, line: 121, baseType: !143, size: 64, offset: 640)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bytes", scope: !154, file: !45, line: 122, baseType: !143, size: 64, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "rec_pkts", scope: !154, file: !45, line: 123, baseType: !143, size: 64, offset: 768)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "rec_bytes", scope: !154, file: !45, line: 124, baseType: !143, size: 64, offset: 832)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "match_on_egress", scope: !154, file: !45, line: 125, baseType: !203, size: 8, offset: 896)
!203 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !154, file: !45, line: 126, baseType: !205, size: 56, offset: 904)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 56, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 7)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flow_event", scope: !150, file: !45, line: 157, baseType: !209, size: 512)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_event", file: !45, line: 132, size: 512, elements: !210)
!210 = !{!211, !212, !213, !214, !215, !216, !217}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !209, file: !45, line: 133, baseType: !143, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !209, file: !45, line: 134, baseType: !143, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !209, file: !45, line: 135, baseType: !159, size: 352, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "flow_event_type", scope: !209, file: !45, line: 136, baseType: !44, size: 8, offset: 480)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !209, file: !45, line: 137, baseType: !52, size: 8, offset: 488)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !209, file: !45, line: 138, baseType: !60, size: 8, offset: 496)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !209, file: !45, line: 139, baseType: !192, size: 8, offset: 504)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "map_event", scope: !150, file: !45, line: 158, baseType: !219, size: 512)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "map_full_event", file: !45, line: 146, size: 512, elements: !220)
!220 = !{!221, !222, !223, !224, !225}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !219, file: !45, line: 147, baseType: !143, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !219, file: !45, line: 148, baseType: !143, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !219, file: !45, line: 149, baseType: !159, size: 352, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !219, file: !45, line: 150, baseType: !65, size: 8, offset: 480)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !219, file: !45, line: 151, baseType: !226, size: 24, offset: 488)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 24, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 3)
!229 = !{!0, !7, !12, !17, !22, !24, !29, !230, !235, !240, !243, !245, !250, !253, !258, !263, !268, !273, !278, !283, !288, !290, !292, !297, !302, !365, !367, !369, !372, !34, !374, !386, !388, !393, !398, !400, !402, !404, !406, !408, !413, !415, !417, !420, !422, !424, !426, !431, !436, !438, !440, !442, !444, !446, !448, !450, !452, !454, !466, !471, !476, !478, !483, !488, !490, !492, !497, !499, !504, !506, !508, !510, !515, !517, !519, !528, !530, !538, !540, !542, !547, !549, !551, !553, !555, !557, !559, !564, !566, !568, !570, !572, !574, !576, !583, !585, !587, !589, !591, !593, !595, !597, !599, !601, !603, !605, !607, !609, !611, !613, !615, !620, !622, !627, !632, !637, !642, !644, !646, !651, !653, !655, !660, !665, !670, !675, !677, !679, !684}
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1033, type: !232, isLocal: true, isDefinition: true)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 13)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1034, type: !237, isLocal: true, isDefinition: true)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 18)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1035, type: !242, isLocal: true, isDefinition: true)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !175)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1036, type: !3, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1037, type: !247, isLocal: true, isDefinition: true)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 11)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1038, type: !252, isLocal: true, isDefinition: true)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !206)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1047, type: !255, isLocal: true, isDefinition: true)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 35)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1054, type: !260, isLocal: true, isDefinition: true)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 38)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1061, type: !265, isLocal: true, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 31)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1073, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 776, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 97)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1087, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 46)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1094, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 49)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1101, type: !285, isLocal: true, isDefinition: true)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 36)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1113, type: !255, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1127, type: !265, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1150, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 440, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 55)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1158, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 54)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "stdin", scope: !36, file: !304, line: 143, type: !305, isLocal: false, isDefinition: false)
!304 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !307, line: 7, baseType: !308)
!307 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !309, line: 49, size: 1728, elements: !310)
!309 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!310 = !{!311, !313, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !328, !330, !331, !332, !335, !336, !338, !342, !345, !349, !352, !355, !356, !357, !360, !361}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !308, file: !309, line: 51, baseType: !312, size: 32)
!312 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !308, file: !309, line: 54, baseType: !314, size: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !308, file: !309, line: 55, baseType: !314, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !308, file: !309, line: 56, baseType: !314, size: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !308, file: !309, line: 57, baseType: !314, size: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !308, file: !309, line: 58, baseType: !314, size: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !308, file: !309, line: 59, baseType: !314, size: 64, offset: 384)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !308, file: !309, line: 60, baseType: !314, size: 64, offset: 448)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !308, file: !309, line: 61, baseType: !314, size: 64, offset: 512)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !308, file: !309, line: 64, baseType: !314, size: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !308, file: !309, line: 65, baseType: !314, size: 64, offset: 640)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !308, file: !309, line: 66, baseType: !314, size: 64, offset: 704)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !308, file: !309, line: 68, baseType: !326, size: 64, offset: 768)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !309, line: 36, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !308, file: !309, line: 70, baseType: !329, size: 64, offset: 832)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !308, file: !309, line: 72, baseType: !312, size: 32, offset: 896)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !308, file: !309, line: 73, baseType: !312, size: 32, offset: 928)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !308, file: !309, line: 74, baseType: !333, size: 64, offset: 960)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !139, line: 152, baseType: !334)
!334 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !308, file: !309, line: 77, baseType: !147, size: 16, offset: 1024)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !308, file: !309, line: 78, baseType: !337, size: 8, offset: 1040)
!337 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !308, file: !309, line: 79, baseType: !339, size: 8, offset: 1048)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 1)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !308, file: !309, line: 81, baseType: !343, size: 64, offset: 1088)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !309, line: 43, baseType: null)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !308, file: !309, line: 89, baseType: !346, size: 64, offset: 1152)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !139, line: 153, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !139, line: 47, baseType: !348)
!348 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !308, file: !309, line: 91, baseType: !350, size: 64, offset: 1216)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !309, line: 37, flags: DIFlagFwdDecl)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !308, file: !309, line: 92, baseType: !353, size: 64, offset: 1280)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !309, line: 38, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !308, file: !309, line: 93, baseType: !329, size: 64, offset: 1344)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !308, file: !309, line: 94, baseType: !141, size: 64, offset: 1408)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !308, file: !309, line: 95, baseType: !358, size: 64, offset: 1472)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !359, line: 46, baseType: !140)
!359 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/demo", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !308, file: !309, line: 96, baseType: !312, size: 32, offset: 1536)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !308, file: !309, line: 98, baseType: !362, size: 160, offset: 1568)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 20)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "stdout", scope: !36, file: !304, line: 144, type: !305, isLocal: false, isDefinition: false)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "stderr", scope: !36, file: !304, line: 145, type: !305, isLocal: false, isDefinition: false)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "optarg", scope: !36, file: !371, line: 36, type: !314, isLocal: false, isDefinition: false)
!371 = !DIFile(filename: "/usr/include/bits/getopt_core.h", directory: "", checksumkind: CSK_MD5, checksum: "81ab788980ce9d5be2ba931a6ae17301")
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "optind", scope: !36, file: !371, line: 50, type: !312, isLocal: false, isDefinition: false)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "buf", scope: !376, file: !2, line: 145, type: !383, isLocal: true, isDefinition: true)
!376 = distinct !DISubprogram(name: "get_libbpf_strerror", scope: !2, file: !2, line: 143, type: !377, scopeLine: 144, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !381)
!377 = !DISubroutineType(types: !378)
!378 = !{!379, !312}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!381 = !{!382}
!382 = !DILocalVariable(name: "err", arg: 1, scope: !376, file: !2, line: 143, type: !312)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1600, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 200)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !2, line: 178, type: !362, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !2, line: 183, type: !390, isLocal: true, isDefinition: true)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 25)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(scope: null, file: !2, line: 192, type: !395, isLocal: true, isDefinition: true)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 41)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !2, line: 200, type: !247, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !2, line: 209, type: !19, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !2, line: 216, type: !9, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !2, line: 219, type: !19, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !2, line: 223, type: !260, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !2, line: 230, type: !410, isLocal: true, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 17)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !2, line: 245, type: !275, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !2, line: 250, type: !9, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !2, line: 252, type: !419, isLocal: true, isDefinition: true)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !227)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !2, line: 253, type: !410, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !2, line: 255, type: !285, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !2, line: 273, type: !252, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !2, line: 277, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 19)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !2, line: 284, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 51)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !2, line: 97, type: !14, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !2, line: 98, type: !3, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !2, line: 101, type: !19, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !2, line: 102, type: !26, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !2, line: 104, type: !252, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !2, line: 105, type: !232, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !2, line: 106, type: !9, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !2, line: 107, type: !14, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !2, line: 108, type: !31, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "long_options", scope: !36, file: !2, line: 96, type: !456, isLocal: true, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 3328, elements: !233)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !459, line: 50, size: 256, elements: !460)
!459 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!460 = !{!461, !462, !463, !465}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !458, file: !459, line: 52, baseType: !379, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !458, file: !459, line: 55, baseType: !312, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !458, file: !459, line: 56, baseType: !464, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !458, file: !459, line: 57, baseType: !312, size: 32, offset: 192)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !2, line: 156, type: !468, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 29)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !2, line: 160, type: !473, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 27)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !2, line: 119, type: !362, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !2, line: 120, type: !480, isLocal: true, isDefinition: true)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 2)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !2, line: 121, type: !485, isLocal: true, isDefinition: true)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: 32)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(scope: null, file: !2, line: 122, type: !428, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !2, line: 124, type: !19, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(scope: null, file: !2, line: 126, type: !494, isLocal: true, isDefinition: true)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 26)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !2, line: 129, type: !428, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 59)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "__doc__", scope: !36, file: !2, line: 2, type: !379, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !2, line: 729, type: !255, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !2, line: 739, type: !14, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !2, line: 741, type: !512, isLocal: true, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 23)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !2, line: 721, type: !19, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !2, line: 722, type: !3, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "offset", scope: !521, file: !2, line: 604, type: !143, isLocal: true, isDefinition: true)
!521 = distinct !DISubprogram(name: "convert_monotonic_to_realtime", scope: !2, file: !2, line: 602, type: !522, scopeLine: 603, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !524)
!522 = !DISubroutineType(types: !523)
!523 = !{!143, !143}
!524 = !{!525, !526, !527}
!525 = !DILocalVariable(name: "monotonic_time", arg: 1, scope: !521, file: !2, line: 602, type: !143)
!526 = !DILocalVariable(name: "now_mon", scope: !521, file: !2, line: 606, type: !143)
!527 = !DILocalVariable(name: "now_rt", scope: !521, file: !2, line: 607, type: !143)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "offset_updated", scope: !521, file: !2, line: 605, type: !143, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "buf", scope: !532, file: !2, line: 640, type: !537, isLocal: true, isDefinition: true)
!532 = distinct !DISubprogram(name: "proto_to_str", scope: !2, file: !2, line: 638, type: !533, scopeLine: 639, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !535)
!533 = !DISubroutineType(types: !534)
!534 = !{!379, !187}
!535 = !{!536}
!536 = !DILocalVariable(name: "proto", arg: 1, scope: !532, file: !2, line: 638, type: !187)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !180)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !2, line: 648, type: !252, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !2, line: 650, type: !419, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !2, line: 711, type: !544, isLocal: true, isDefinition: true)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 12)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(scope: null, file: !2, line: 659, type: !14, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !2, line: 661, type: !537, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !2, line: 664, type: !537, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !2, line: 666, type: !537, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !2, line: 674, type: !9, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !2, line: 676, type: !537, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !2, line: 678, type: !561, isLocal: true, isDefinition: true)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 22)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !2, line: 680, type: !9, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !2, line: 682, type: !9, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !2, line: 684, type: !232, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !2, line: 694, type: !9, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !2, line: 696, type: !14, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !2, line: 698, type: !237, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "print_event_func", scope: !36, file: !2, line: 94, type: !578, isLocal: true, isDefinition: true)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !2, line: 774, type: !3, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !2, line: 776, type: !252, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !2, line: 777, type: !19, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !2, line: 778, type: !537, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !2, line: 779, type: !3, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !2, line: 780, type: !19, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !2, line: 786, type: !9, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !2, line: 787, type: !537, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !2, line: 788, type: !232, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !2, line: 789, type: !247, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !2, line: 790, type: !544, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !2, line: 791, type: !3, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !2, line: 792, type: !242, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !2, line: 798, type: !247, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !2, line: 800, type: !252, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !2, line: 802, type: !232, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !2, line: 757, type: !617, isLocal: true, isDefinition: true)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 37)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !2, line: 910, type: !255, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !2, line: 918, type: !624, isLocal: true, isDefinition: true)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 44)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !2, line: 926, type: !629, isLocal: true, isDefinition: true)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 39)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !2, line: 938, type: !634, isLocal: true, isDefinition: true)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 57)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !2, line: 956, type: !639, isLocal: true, isDefinition: true)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 58)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !2, line: 971, type: !395, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !2, line: 327, type: !537, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !2, line: 892, type: !648, isLocal: true, isDefinition: true)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 64)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !2, line: 896, type: !485, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !2, line: 986, type: !265, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !2, line: 993, type: !657, isLocal: true, isDefinition: true)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 45)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1011, type: !662, isLocal: true, isDefinition: true)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 60)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !2, line: 574, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 552, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 69)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !2, line: 849, type: !672, isLocal: true, isDefinition: true)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 34)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !2, line: 827, type: !275, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !2, line: 828, type: !14, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !2, line: 856, type: !681, isLocal: true, isDefinition: true)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 28)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "json_ctx", scope: !36, file: !2, line: 93, type: !686, isLocal: true, isDefinition: true)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_writer_t", file: !688, line: 21, baseType: !689)
!688 = !DIFile(filename: "../lib/util/json_writer.h", directory: "/home/demo/bpf-examples/pping", checksumkind: CSK_MD5, checksum: "a3d1c9d40d0b039d45a7ff575e542b45")
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "json_writer", file: !688, line: 21, flags: DIFlagFwdDecl)
!690 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !312)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "_license", scope: !693, file: !694, line: 82, type: !9, isLocal: false, isDefinition: true)
!693 = distinct !DICompileUnit(language: DW_LANG_C11, file: !694, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !695, retainedTypes: !728, globals: !748, splitDebugInlining: false, nameTableKind: None)
!694 = !DIFile(filename: "pping_kern.c", directory: "/home/demo/bpf-examples/pping", checksumkind: CSK_MD5, checksum: "ba8946e8e057f67fd5341ac949fe30c6")
!695 = !{!696, !52, !44, !704, !706, !65, !712, !717, !60}
!696 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !697, line: 4363, baseType: !39, size: 32, elements: !698)
!697 = !DIFile(filename: "../lib/../headers/linux/bpf.h", directory: "/home/demo/bpf-examples/pping", checksumkind: CSK_MD5, checksum: "686704d11802f5f210143bc29244c61a")
!698 = !{!699, !700, !701, !702, !703}
!699 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!700 = !DIEnumerator(name: "XDP_DROP", value: 1)
!701 = !DIEnumerator(name: "XDP_PASS", value: 2)
!702 = !DIEnumerator(name: "XDP_TX", value: 3)
!703 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!704 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !705, line: 28, baseType: !39, size: 32, elements: !99)
!705 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "078a32220dc819f6a7e2ea3cecc4e133")
!706 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !697, line: 397, baseType: !39, size: 32, elements: !707)
!707 = !{!708, !709, !710, !711}
!708 = !DIEnumerator(name: "BPF_ANY", value: 0)
!709 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!710 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!711 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!712 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !697, line: 4063, baseType: !140, size: 64, elements: !713)
!713 = !{!714, !715, !716}
!714 = !DIEnumerator(name: "BPF_F_INDEX_MASK", value: 4294967295, isUnsigned: true)
!715 = !DIEnumerator(name: "BPF_F_CURRENT_CPU", value: 4294967295, isUnsigned: true)
!716 = !DIEnumerator(name: "BPF_F_CTXLEN_MASK", value: 4503595332403200, isUnsigned: true)
!717 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !697, line: 4955, baseType: !39, size: 32, elements: !718)
!718 = !{!719, !720, !721, !722, !723, !724, !725, !726, !727}
!719 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_SUCCESS", value: 0)
!720 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_BLACKHOLE", value: 1)
!721 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_UNREACHABLE", value: 2)
!722 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_PROHIBIT", value: 3)
!723 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_NOT_FWDED", value: 4)
!724 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_FWD_DISABLED", value: 5)
!725 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_UNSUPP_LWT", value: 6)
!726 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_NO_NEIGH", value: 7)
!727 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_FRAG_NEEDED", value: 8)
!728 = !{!141, !334, !187, !314, !729, !730, !731, !747, !746, !195}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !733, line: 33, size: 128, elements: !734)
!733 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "fca1889f0274df066e49cf4d8db8011e")
!734 = !{!735}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !732, file: !733, line: 40, baseType: !736, size: 128)
!736 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !732, file: !733, line: 34, size: 128, elements: !737)
!737 = !{!738, !740, !744}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !736, file: !733, line: 35, baseType: !739, size: 128)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 128, elements: !175)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !736, file: !733, line: 37, baseType: !741, size: 128)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !742, size: 128, elements: !180)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !743, line: 25, baseType: !187)
!743 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "710687c858b58f42afb1bfdfe3f8dee9")
!744 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !736, file: !733, line: 38, baseType: !745, size: 128)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 128, elements: !10)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !743, line: 27, baseType: !195)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!748 = !{!691, !749, !780, !803, !812, !818, !831, !838, !843, !847, !852, !888}
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "packet_ts", scope: !693, file: !694, line: 94, type: !751, isLocal: false, isDefinition: true)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !694, line: 89, size: 256, elements: !752)
!752 = !{!753, !756, !774, !775}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !751, file: !694, line: 90, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 32, elements: !340)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !751, file: !694, line: 91, baseType: !757, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_id", file: !45, line: 96, size: 384, elements: !759)
!759 = !{!760, !773}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !758, file: !45, line: 97, baseType: !761, size: 352)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "network_tuple", file: !45, line: 74, size: 352, elements: !762)
!762 = !{!763, !769, !770, !771, !772}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !761, file: !45, line: 75, baseType: !764, size: 160)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_address", file: !45, line: 61, size: 160, elements: !765)
!765 = !{!766, !767, !768}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !764, file: !45, line: 62, baseType: !732, size: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !764, file: !45, line: 63, baseType: !187, size: 16, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !764, file: !45, line: 64, baseType: !187, size: 16, offset: 144)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !761, file: !45, line: 76, baseType: !764, size: 160, offset: 160)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !761, file: !45, line: 77, baseType: !187, size: 16, offset: 320)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ipv", scope: !761, file: !45, line: 78, baseType: !192, size: 8, offset: 336)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !761, file: !45, line: 79, baseType: !192, size: 8, offset: 344)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !758, file: !45, line: 98, baseType: !195, size: 32, offset: 352)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !751, file: !694, line: 92, baseType: !148, size: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !751, file: !694, line: 93, baseType: !776, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 524288, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 16384)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "flow_state", scope: !693, file: !694, line: 101, type: !782, isLocal: false, isDefinition: true)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !694, line: 96, size: 256, elements: !783)
!783 = !{!784, !785, !787, !802}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !782, file: !694, line: 97, baseType: !754, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !782, file: !694, line: 98, baseType: !786, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !782, file: !694, line: 99, baseType: !788, size: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_state", file: !45, line: 82, size: 512, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "min_rtt", scope: !789, file: !45, line: 83, baseType: !143, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "srtt", scope: !789, file: !45, line: 84, baseType: !143, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !789, file: !45, line: 85, baseType: !143, size: 64, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "sent_pkts", scope: !789, file: !45, line: 86, baseType: !143, size: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bytes", scope: !789, file: !45, line: 87, baseType: !143, size: 64, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "rec_pkts", scope: !789, file: !45, line: 88, baseType: !143, size: 64, offset: 320)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "rec_bytes", scope: !789, file: !45, line: 89, baseType: !143, size: 64, offset: 384)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "last_id", scope: !789, file: !45, line: 90, baseType: !195, size: 32, offset: 448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "has_opened", scope: !789, file: !45, line: 91, baseType: !203, size: 8, offset: 480)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "opening_reason", scope: !789, file: !45, line: 92, baseType: !52, size: 8, offset: 488)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !789, file: !45, line: 93, baseType: !187, size: 16, offset: 496)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !782, file: !694, line: 100, baseType: !776, size: 64, offset: 192)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "events", scope: !693, file: !694, line: 107, type: !805, isLocal: false, isDefinition: true)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !694, line: 103, size: 192, elements: !806)
!806 = !{!807, !810, !811}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !805, file: !694, line: 104, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 128, elements: !10)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !805, file: !694, line: 105, baseType: !808, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !805, file: !694, line: 106, baseType: !808, size: 64, offset: 128)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !693, file: !814, line: 109, type: !815, isLocal: true, isDefinition: true)
!814 = !DIFile(filename: "../lib/libbpf-install/usr/include/bpf/bpf_helper_defs.h", directory: "/home/demo/bpf-examples/pping", checksumkind: CSK_MD5, checksum: "52f02fca464a4053efa2721be82f1a3e")
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!143}
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "config", scope: !693, file: !694, line: 84, type: !820, isLocal: true, isDefinition: true)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_config", file: !45, line: 46, size: 192, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829, !830}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "rate_limit", scope: !822, file: !45, line: 47, baseType: !143, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "rtt_rate", scope: !822, file: !45, line: 48, baseType: !142, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "use_srtt", scope: !822, file: !45, line: 49, baseType: !203, size: 8, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "track_tcp", scope: !822, file: !45, line: 50, baseType: !203, size: 8, offset: 136)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "track_icmp", scope: !822, file: !45, line: 51, baseType: !203, size: 8, offset: 144)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "localfilt", scope: !822, file: !45, line: 52, baseType: !203, size: 8, offset: 152)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !822, file: !45, line: 53, baseType: !195, size: 32, offset: 160)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !693, file: !814, line: 51, type: !833, isLocal: true, isDefinition: true)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!141, !141, !836}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !693, file: !814, line: 73, type: !840, isLocal: true, isDefinition: true)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!334, !141, !836, !836, !143}
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "last_warn_time", scope: !693, file: !694, line: 85, type: !845, isLocal: true, isDefinition: true)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !846, size: 128, elements: !481)
!846 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !143)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "bpf_perf_event_output", scope: !693, file: !814, line: 686, type: !849, isLocal: true, isDefinition: true)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!334, !141, !141, !143, !141, !143}
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "bpf_fib_lookup", scope: !693, file: !814, line: 1816, type: !854, isLocal: true, isDefinition: true)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!334, !141, !857, !312, !195}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_fib_lookup", file: !697, line: 4967, size: 512, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865, !866, !872, !878, !883, !884, !885, !887}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !858, file: !697, line: 4971, baseType: !192, size: 8)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "l4_protocol", scope: !858, file: !697, line: 4974, baseType: !192, size: 8, offset: 8)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !858, file: !697, line: 4975, baseType: !742, size: 16, offset: 16)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !858, file: !697, line: 4976, baseType: !742, size: 16, offset: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !858, file: !697, line: 4979, baseType: !187, size: 16, offset: 48)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !858, file: !697, line: 4984, baseType: !195, size: 32, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, scope: !858, file: !697, line: 4986, baseType: !867, size: 32, offset: 96)
!867 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !858, file: !697, line: 4986, size: 32, elements: !868)
!868 = !{!869, !870, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !867, file: !697, line: 4988, baseType: !192, size: 8)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "flowinfo", scope: !867, file: !697, line: 4989, baseType: !746, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rt_metric", scope: !867, file: !697, line: 4992, baseType: !195, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, scope: !858, file: !697, line: 4995, baseType: !873, size: 128, offset: 128)
!873 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !858, file: !697, line: 4995, size: 128, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !873, file: !697, line: 4996, baseType: !746, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !873, file: !697, line: 4997, baseType: !877, size: 128)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 128, elements: !10)
!878 = !DIDerivedType(tag: DW_TAG_member, scope: !858, file: !697, line: 5004, baseType: !879, size: 128, offset: 256)
!879 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !858, file: !697, line: 5004, size: 128, elements: !880)
!880 = !{!881, !882}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !879, file: !697, line: 5005, baseType: !746, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !879, file: !697, line: 5006, baseType: !877, size: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_proto", scope: !858, file: !697, line: 5010, baseType: !742, size: 16, offset: 384)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !858, file: !697, line: 5011, baseType: !742, size: 16, offset: 400)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "smac", scope: !858, file: !697, line: 5012, baseType: !886, size: 48, offset: 416)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 48, elements: !27)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "dmac", scope: !858, file: !697, line: 5013, baseType: !886, size: 48, offset: 464)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(name: "bpf_map_delete_elem", scope: !693, file: !814, line: 83, type: !890, isLocal: true, isDefinition: true)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!334, !141, !836}
!893 = !{!"clang version 16.0.0"}
!894 = !{i32 7, !"Dwarf Version", i32 5}
!895 = !{i32 2, !"Debug Info Version", i32 3}
!896 = !{i32 1, !"wchar_size", i32 4}
!897 = !{i32 7, !"frame-pointer", i32 2}
!898 = distinct !DISubprogram(name: "tracked_protocols_to_str", scope: !2, file: !2, line: 291, type: !899, scopeLine: 292, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !939)
!899 = !DISubroutineType(types: !900)
!900 = !{!379, !901}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pping_config", file: !2, line: 71, size: 1472, elements: !903)
!903 = !{!904, !914, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "bpf_config", scope: !902, file: !2, line: 72, baseType: !905, size: 192)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_config", file: !45, line: 46, size: 192, elements: !906)
!906 = !{!907, !908, !909, !910, !911, !912, !913}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "rate_limit", scope: !905, file: !45, line: 47, baseType: !143, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "rtt_rate", scope: !905, file: !45, line: 48, baseType: !142, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "use_srtt", scope: !905, file: !45, line: 49, baseType: !203, size: 8, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "track_tcp", scope: !905, file: !45, line: 50, baseType: !203, size: 8, offset: 136)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "track_icmp", scope: !905, file: !45, line: 51, baseType: !203, size: 8, offset: 144)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "localfilt", scope: !905, file: !45, line: 52, baseType: !203, size: 8, offset: 152)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !905, file: !45, line: 53, baseType: !195, size: 32, offset: 160)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "tc_ingress_opts", scope: !902, file: !2, line: 73, baseType: !915, size: 256, offset: 192)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_tc_opts", file: !70, line: 866, size: 256, elements: !916)
!916 = !{!917, !918, !919, !920, !921, !922}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !915, file: !70, line: 867, baseType: !358, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "prog_fd", scope: !915, file: !70, line: 868, baseType: !312, size: 32, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !915, file: !70, line: 869, baseType: !195, size: 32, offset: 96)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "prog_id", scope: !915, file: !70, line: 870, baseType: !195, size: 32, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !915, file: !70, line: 871, baseType: !195, size: 32, offset: 160)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !915, file: !70, line: 872, baseType: !195, size: 32, offset: 192)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "tc_egress_opts", scope: !902, file: !2, line: 74, baseType: !915, size: 256, offset: 448)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_interval", scope: !902, file: !2, line: 75, baseType: !143, size: 64, offset: 704)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "object_path", scope: !902, file: !2, line: 76, baseType: !314, size: 64, offset: 768)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_prog", scope: !902, file: !2, line: 77, baseType: !314, size: 64, offset: 832)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "egress_prog", scope: !902, file: !2, line: 78, baseType: !314, size: 64, offset: 896)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "packet_map", scope: !902, file: !2, line: 79, baseType: !314, size: 64, offset: 960)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "flow_map", scope: !902, file: !2, line: 80, baseType: !314, size: 64, offset: 1024)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "event_map", scope: !902, file: !2, line: 81, baseType: !314, size: 64, offset: 1088)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "xdp_flags", scope: !902, file: !2, line: 82, baseType: !312, size: 32, offset: 1152)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !902, file: !2, line: 83, baseType: !312, size: 32, offset: 1184)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_prog_id", scope: !902, file: !2, line: 84, baseType: !312, size: 32, offset: 1216)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "egress_prog_id", scope: !902, file: !2, line: 85, baseType: !312, size: 32, offset: 1248)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !902, file: !2, line: 86, baseType: !242, size: 128, offset: 1280)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "output_format", scope: !902, file: !2, line: 87, baseType: !38, size: 32, offset: 1408)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "force", scope: !902, file: !2, line: 88, baseType: !203, size: 8, offset: 1440)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "created_tc_hook", scope: !902, file: !2, line: 89, baseType: !203, size: 8, offset: 1448)
!939 = !{!940, !941, !942}
!940 = !DILocalVariable(name: "config", arg: 1, scope: !898, file: !2, line: 291, type: !901)
!941 = !DILocalVariable(name: "tcp", scope: !898, file: !2, line: 293, type: !203)
!942 = !DILocalVariable(name: "icmp", scope: !898, file: !2, line: 294, type: !203)
!943 = !{!944, !944, i64 0}
!944 = !{!"any pointer", !945, i64 0}
!945 = !{!"omnipotent char", !946, i64 0}
!946 = !{!"Simple C/C++ TBAA"}
!947 = !DILocation(line: 291, column: 59, scope: !898)
!948 = !DILocation(line: 293, column: 2, scope: !898)
!949 = !DILocation(line: 293, column: 7, scope: !898)
!950 = !DILocation(line: 293, column: 13, scope: !898)
!951 = !DILocation(line: 293, column: 21, scope: !898)
!952 = !DILocation(line: 293, column: 32, scope: !898)
!953 = !{!954, !957, i64 17}
!954 = !{!"pping_config", !955, i64 0, !959, i64 24, !959, i64 56, !956, i64 88, !944, i64 96, !944, i64 104, !944, i64 112, !944, i64 120, !944, i64 128, !944, i64 136, !958, i64 144, !958, i64 148, !958, i64 152, !958, i64 156, !945, i64 160, !945, i64 176, !957, i64 180, !957, i64 181}
!955 = !{!"bpf_config", !956, i64 0, !956, i64 8, !957, i64 16, !957, i64 17, !957, i64 18, !957, i64 19, !958, i64 20}
!956 = !{!"long long", !945, i64 0}
!957 = !{!"_Bool", !945, i64 0}
!958 = !{!"int", !945, i64 0}
!959 = !{!"bpf_tc_opts", !960, i64 0, !958, i64 8, !958, i64 12, !958, i64 16, !958, i64 20, !958, i64 24}
!960 = !{!"long", !945, i64 0}
!961 = !{i8 0, i8 2}
!962 = !{}
!963 = !{!957, !957, i64 0}
!964 = !DILocation(line: 294, column: 2, scope: !898)
!965 = !DILocation(line: 294, column: 7, scope: !898)
!966 = !DILocation(line: 294, column: 14, scope: !898)
!967 = !DILocation(line: 294, column: 22, scope: !898)
!968 = !DILocation(line: 294, column: 33, scope: !898)
!969 = !{!954, !957, i64 18}
!970 = !DILocation(line: 295, column: 9, scope: !898)
!971 = !DILocation(line: 295, column: 13, scope: !898)
!972 = !DILocation(line: 295, column: 16, scope: !898)
!973 = !DILocation(line: 295, column: 37, scope: !898)
!974 = !DILocation(line: 296, column: 1, scope: !898)
!975 = !DILocation(line: 295, column: 2, scope: !898)
!976 = distinct !DISubprogram(name: "output_format_to_str", scope: !2, file: !2, line: 298, type: !977, scopeLine: 299, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !979)
!977 = !DISubroutineType(types: !978)
!978 = !{!379, !38}
!979 = !{!980}
!980 = !DILocalVariable(name: "format", arg: 1, scope: !976, file: !2, line: 298, type: !38)
!981 = !{!945, !945, i64 0}
!982 = !DILocation(line: 298, column: 59, scope: !976)
!983 = !DILocation(line: 300, column: 10, scope: !976)
!984 = !DILocation(line: 300, column: 2, scope: !976)
!985 = !DILocation(line: 301, column: 30, scope: !986)
!986 = distinct !DILexicalBlock(scope: !976, file: !2, line: 300, column: 18)
!987 = !DILocation(line: 302, column: 26, scope: !986)
!988 = !DILocation(line: 303, column: 27, scope: !986)
!989 = !DILocation(line: 304, column: 11, scope: !986)
!990 = !DILocation(line: 306, column: 1, scope: !976)
!991 = distinct !DISubprogram(name: "abort_program", scope: !2, file: !2, line: 308, type: !992, scopeLine: 309, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !994)
!992 = !DISubroutineType(types: !993)
!993 = !{null, !312}
!994 = !{!995}
!995 = !DILocalVariable(name: "sig", arg: 1, scope: !991, file: !2, line: 308, type: !312)
!996 = !{!958, !958, i64 0}
!997 = !DILocation(line: 308, column: 24, scope: !991)
!998 = !DILocation(line: 310, column: 15, scope: !991)
!999 = !DILocation(line: 311, column: 1, scope: !991)
!1000 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 1019, type: !1001, scopeLine: 1020, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !1004)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!312, !312, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1012, !1015, !1016, !1017, !1018}
!1005 = !DILocalVariable(name: "argc", arg: 1, scope: !1000, file: !2, line: 1019, type: !312)
!1006 = !DILocalVariable(name: "argv", arg: 2, scope: !1000, file: !2, line: 1019, type: !1003)
!1007 = !DILocalVariable(name: "err", scope: !1000, file: !2, line: 1021, type: !312)
!1008 = !DILocalVariable(name: "detach_err", scope: !1000, file: !2, line: 1021, type: !312)
!1009 = !DILocalVariable(name: "obj", scope: !1000, file: !2, line: 1022, type: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_object", file: !70, line: 66, flags: DIFlagFwdDecl)
!1012 = !DILocalVariable(name: "pb", scope: !1000, file: !2, line: 1023, type: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DICompositeType(tag: DW_TAG_structure_type, name: "perf_buffer", file: !70, line: 908, flags: DIFlagFwdDecl)
!1015 = !DILocalVariable(name: "tc_ingress_opts", scope: !1000, file: !2, line: 1025, type: !915)
!1016 = !DILocalVariable(name: "tc_egress_opts", scope: !1000, file: !2, line: 1026, type: !915)
!1017 = !DILocalVariable(name: "config", scope: !1000, file: !2, line: 1028, type: !902)
!1018 = !DILabel(scope: !1000, name: "cleanup_attached_progs", file: !2, line: 1141)
!1019 = !DILocation(line: 1019, column: 14, scope: !1000)
!1020 = !DILocation(line: 1019, column: 26, scope: !1000)
!1021 = !DILocation(line: 1021, column: 2, scope: !1000)
!1022 = !DILocation(line: 1021, column: 6, scope: !1000)
!1023 = !DILocation(line: 1021, column: 15, scope: !1000)
!1024 = !DILocation(line: 1022, column: 2, scope: !1000)
!1025 = !DILocation(line: 1022, column: 21, scope: !1000)
!1026 = !DILocation(line: 1023, column: 2, scope: !1000)
!1027 = !DILocation(line: 1023, column: 22, scope: !1000)
!1028 = !DILocation(line: 1025, column: 2, scope: !1000)
!1029 = !DILocation(line: 1025, column: 2, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1000, file: !2, line: 1025, column: 2)
!1031 = !{!959, !960, i64 0}
!1032 = !DILocation(line: 1026, column: 2, scope: !1000)
!1033 = !DILocation(line: 1026, column: 2, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1000, file: !2, line: 1026, column: 2)
!1035 = !DILocation(line: 1028, column: 2, scope: !1000)
!1036 = !DILocation(line: 1028, column: 22, scope: !1000)
!1037 = !DILocation(line: 1028, column: 31, scope: !1000)
!1038 = !DILocation(line: 1029, column: 17, scope: !1000)
!1039 = !{!955, !956, i64 0}
!1040 = !{!955, !956, i64 8}
!1041 = !{!955, !957, i64 16}
!1042 = !{!955, !957, i64 17}
!1043 = !{!955, !957, i64 18}
!1044 = !{!955, !957, i64 19}
!1045 = !{!955, !958, i64 20}
!1046 = !DILocation(line: 1040, column: 22, scope: !1000)
!1047 = !{i64 0, i64 8, !1048, i64 8, i64 4, !996, i64 12, i64 4, !996, i64 16, i64 4, !996, i64 20, i64 4, !996, i64 24, i64 4, !996}
!1048 = !{!960, !960, i64 0}
!1049 = !DILocation(line: 1041, column: 21, scope: !1000)
!1050 = !{!954, !956, i64 88}
!1051 = !{!954, !944, i64 96}
!1052 = !{!954, !944, i64 104}
!1053 = !{!954, !944, i64 112}
!1054 = !{!954, !944, i64 120}
!1055 = !{!954, !944, i64 128}
!1056 = !{!954, !944, i64 136}
!1057 = !{!954, !958, i64 144}
!1058 = !{!954, !958, i64 148}
!1059 = !{!954, !958, i64 152}
!1060 = !{!954, !958, i64 156}
!1061 = !{!954, !945, i64 176}
!1062 = !{!954, !957, i64 180}
!1063 = !{!954, !957, i64 181}
!1064 = !DILocation(line: 1046, column: 6, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1000, file: !2, line: 1046, column: 6)
!1066 = !DILocation(line: 1046, column: 16, scope: !1065)
!1067 = !DILocation(line: 1046, column: 6, scope: !1000)
!1068 = !DILocation(line: 1047, column: 3, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1065, file: !2, line: 1046, column: 22)
!1070 = !DILocation(line: 1048, column: 3, scope: !1069)
!1071 = !DILocation(line: 1052, column: 8, scope: !1000)
!1072 = !DILocation(line: 1052, column: 6, scope: !1000)
!1073 = !DILocation(line: 1053, column: 6, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !1000, file: !2, line: 1053, column: 6)
!1075 = !DILocation(line: 1053, column: 6, scope: !1000)
!1076 = !DILocation(line: 1054, column: 11, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1074, file: !2, line: 1053, column: 11)
!1078 = !DILocation(line: 1055, column: 24, scope: !1077)
!1079 = !DILocation(line: 1055, column: 4, scope: !1077)
!1080 = !DILocation(line: 1054, column: 3, scope: !1077)
!1081 = !DILocation(line: 1056, column: 3, scope: !1077)
!1082 = !DILocation(line: 1059, column: 24, scope: !1000)
!1083 = !DILocation(line: 1059, column: 30, scope: !1000)
!1084 = !DILocation(line: 1059, column: 8, scope: !1000)
!1085 = !DILocation(line: 1059, column: 6, scope: !1000)
!1086 = !DILocation(line: 1060, column: 6, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1000, file: !2, line: 1060, column: 6)
!1088 = !DILocation(line: 1060, column: 6, scope: !1000)
!1089 = !DILocation(line: 1061, column: 11, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1087, file: !2, line: 1060, column: 11)
!1091 = !DILocation(line: 1062, column: 24, scope: !1090)
!1092 = !DILocation(line: 1062, column: 4, scope: !1090)
!1093 = !DILocation(line: 1061, column: 3, scope: !1090)
!1094 = !DILocation(line: 1063, column: 15, scope: !1090)
!1095 = !DILocation(line: 1063, column: 3, scope: !1090)
!1096 = !DILocation(line: 1064, column: 3, scope: !1090)
!1097 = !DILocation(line: 1067, column: 14, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1000, file: !2, line: 1067, column: 6)
!1099 = !DILocation(line: 1067, column: 25, scope: !1098)
!1100 = !DILocation(line: 1067, column: 35, scope: !1098)
!1101 = !DILocation(line: 1067, column: 46, scope: !1098)
!1102 = !DILocation(line: 1067, column: 57, scope: !1098)
!1103 = !DILocation(line: 1067, column: 6, scope: !1000)
!1104 = !DILocation(line: 1068, column: 10, scope: !1098)
!1105 = !DILocation(line: 1068, column: 21, scope: !1098)
!1106 = !DILocation(line: 1068, column: 31, scope: !1098)
!1107 = !DILocation(line: 1068, column: 3, scope: !1098)
!1108 = !DILocation(line: 1070, column: 13, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1000, file: !2, line: 1070, column: 6)
!1110 = !DILocation(line: 1070, column: 24, scope: !1109)
!1111 = !DILocation(line: 1070, column: 35, scope: !1109)
!1112 = !DILocation(line: 1071, column: 13, scope: !1109)
!1113 = !DILocation(line: 1071, column: 27, scope: !1109)
!1114 = !DILocation(line: 1070, column: 6, scope: !1000)
!1115 = !DILocation(line: 1072, column: 11, scope: !1109)
!1116 = !DILocation(line: 1072, column: 3, scope: !1109)
!1117 = !DILocation(line: 1075, column: 17, scope: !1000)
!1118 = !DILocation(line: 1075, column: 2, scope: !1000)
!1119 = !DILocation(line: 1077, column: 20, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1000, file: !2, line: 1075, column: 32)
!1121 = !DILocation(line: 1078, column: 3, scope: !1120)
!1122 = !DILocation(line: 1080, column: 20, scope: !1120)
!1123 = !DILocation(line: 1081, column: 3, scope: !1120)
!1124 = !DILocation(line: 1083, column: 20, scope: !1120)
!1125 = !DILocation(line: 1084, column: 3, scope: !1120)
!1126 = !DILocation(line: 1087, column: 10, scope: !1000)
!1127 = !DILocation(line: 1088, column: 31, scope: !1000)
!1128 = !DILocation(line: 1088, column: 3, scope: !1000)
!1129 = !DILocation(line: 1089, column: 3, scope: !1000)
!1130 = !DILocation(line: 1089, column: 45, scope: !1000)
!1131 = !DILocation(line: 1089, column: 38, scope: !1000)
!1132 = !DILocation(line: 1087, column: 2, scope: !1000)
!1133 = !DILocation(line: 1091, column: 8, scope: !1000)
!1134 = !DILocation(line: 1091, column: 6, scope: !1000)
!1135 = !DILocation(line: 1092, column: 6, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1000, file: !2, line: 1092, column: 6)
!1137 = !DILocation(line: 1092, column: 6, scope: !1000)
!1138 = !DILocation(line: 1093, column: 11, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1136, file: !2, line: 1092, column: 11)
!1140 = !DILocation(line: 1095, column: 11, scope: !1139)
!1141 = !DILocation(line: 1093, column: 3, scope: !1139)
!1142 = !DILocation(line: 1096, column: 3, scope: !1139)
!1143 = !DILocation(line: 1099, column: 38, scope: !1000)
!1144 = !DILocation(line: 1099, column: 8, scope: !1000)
!1145 = !DILocation(line: 1099, column: 6, scope: !1000)
!1146 = !DILocation(line: 1100, column: 6, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1000, file: !2, line: 1100, column: 6)
!1148 = !DILocation(line: 1100, column: 6, scope: !1000)
!1149 = !DILocation(line: 1101, column: 11, scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !1147, file: !2, line: 1100, column: 11)
!1151 = !DILocation(line: 1102, column: 24, scope: !1150)
!1152 = !DILocation(line: 1102, column: 4, scope: !1150)
!1153 = !DILocation(line: 1101, column: 3, scope: !1150)
!1154 = !DILocation(line: 1103, column: 3, scope: !1150)
!1155 = !DILocation(line: 1107, column: 7, scope: !1000)
!1156 = !DILocation(line: 1107, column: 5, scope: !1000)
!1157 = !DILocation(line: 1111, column: 25, scope: !1000)
!1158 = !DILocation(line: 1111, column: 8, scope: !1000)
!1159 = !DILocation(line: 1111, column: 6, scope: !1000)
!1160 = !DILocation(line: 1112, column: 6, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1000, file: !2, line: 1112, column: 6)
!1162 = !DILocation(line: 1112, column: 6, scope: !1000)
!1163 = !DILocation(line: 1113, column: 11, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1161, file: !2, line: 1112, column: 11)
!1165 = !DILocation(line: 1114, column: 11, scope: !1164)
!1166 = !DILocation(line: 1114, column: 42, scope: !1164)
!1167 = !DILocation(line: 1114, column: 22, scope: !1164)
!1168 = !DILocation(line: 1113, column: 3, scope: !1164)
!1169 = !DILocation(line: 1115, column: 3, scope: !1164)
!1170 = !DILocation(line: 1119, column: 2, scope: !1000)
!1171 = !DILocation(line: 1120, column: 2, scope: !1000)
!1172 = !DILocation(line: 1123, column: 2, scope: !1000)
!1173 = !DILocation(line: 1123, column: 9, scope: !1000)
!1174 = !DILocation(line: 1124, column: 32, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1176, file: !2, line: 1124, column: 7)
!1176 = distinct !DILexicalBlock(scope: !1000, file: !2, line: 1123, column: 23)
!1177 = !DILocation(line: 1124, column: 14, scope: !1175)
!1178 = !DILocation(line: 1124, column: 12, scope: !1175)
!1179 = !DILocation(line: 1124, column: 59, scope: !1175)
!1180 = !DILocation(line: 1124, column: 7, scope: !1176)
!1181 = !DILocation(line: 1125, column: 8, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1183, file: !2, line: 1125, column: 8)
!1183 = distinct !DILexicalBlock(scope: !1175, file: !2, line: 1124, column: 64)
!1184 = !DILocation(line: 1125, column: 8, scope: !1183)
!1185 = !DILocation(line: 1126, column: 13, scope: !1182)
!1186 = !DILocation(line: 1128, column: 27, scope: !1182)
!1187 = !DILocation(line: 1128, column: 26, scope: !1182)
!1188 = !DILocation(line: 1128, column: 6, scope: !1182)
!1189 = !DILocation(line: 1126, column: 5, scope: !1182)
!1190 = !DILocation(line: 1129, column: 4, scope: !1183)
!1191 = distinct !{!1191, !1172, !1192, !1193}
!1192 = !DILocation(line: 1131, column: 2, scope: !1000)
!1193 = !{!"llvm.loop.mustprogress"}
!1194 = !DILocation(line: 1134, column: 13, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1000, file: !2, line: 1134, column: 6)
!1196 = !DILocation(line: 1134, column: 27, scope: !1195)
!1197 = !DILocation(line: 1134, column: 48, scope: !1195)
!1198 = !DILocation(line: 1134, column: 51, scope: !1195)
!1199 = !DILocation(line: 1134, column: 6, scope: !1000)
!1200 = !DILocation(line: 1135, column: 19, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1195, file: !2, line: 1134, column: 61)
!1202 = !DILocation(line: 1135, column: 3, scope: !1201)
!1203 = !DILocation(line: 1136, column: 3, scope: !1201)
!1204 = !DILocation(line: 1137, column: 2, scope: !1201)
!1205 = !DILocation(line: 1139, column: 20, scope: !1000)
!1206 = !DILocation(line: 1139, column: 2, scope: !1000)
!1207 = !DILocation(line: 1141, column: 1, scope: !1000)
!1208 = !DILocation(line: 1142, column: 20, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1000, file: !2, line: 1142, column: 6)
!1210 = !DILocation(line: 1142, column: 6, scope: !1209)
!1211 = !DILocation(line: 1142, column: 55, scope: !1209)
!1212 = !DILocation(line: 1142, column: 6, scope: !1000)
!1213 = !DILocation(line: 1143, column: 34, scope: !1209)
!1214 = !DILocation(line: 1143, column: 50, scope: !1209)
!1215 = !DILocation(line: 1144, column: 13, scope: !1209)
!1216 = !DILocation(line: 1143, column: 16, scope: !1209)
!1217 = !DILocation(line: 1143, column: 14, scope: !1209)
!1218 = !DILocation(line: 1143, column: 3, scope: !1209)
!1219 = !DILocation(line: 1146, column: 33, scope: !1209)
!1220 = !DILocation(line: 1147, column: 20, scope: !1209)
!1221 = !DILocation(line: 1146, column: 16, scope: !1209)
!1222 = !DILocation(line: 1146, column: 14, scope: !1209)
!1223 = !DILocation(line: 1148, column: 6, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1000, file: !2, line: 1148, column: 6)
!1225 = !DILocation(line: 1148, column: 6, scope: !1000)
!1226 = !DILocation(line: 1149, column: 11, scope: !1224)
!1227 = !DILocation(line: 1151, column: 11, scope: !1224)
!1228 = !DILocation(line: 1151, column: 4, scope: !1224)
!1229 = !DILocation(line: 1151, column: 39, scope: !1224)
!1230 = !DILocation(line: 1151, column: 19, scope: !1224)
!1231 = !DILocation(line: 1149, column: 3, scope: !1224)
!1232 = !DILocation(line: 1154, column: 20, scope: !1000)
!1233 = !DILocation(line: 1154, column: 52, scope: !1000)
!1234 = !DILocation(line: 1155, column: 13, scope: !1000)
!1235 = !DILocation(line: 1155, column: 19, scope: !1000)
!1236 = !DILocation(line: 1155, column: 29, scope: !1000)
!1237 = !DILocation(line: 0, scope: !1000)
!1238 = !DILocation(line: 1154, column: 3, scope: !1000)
!1239 = !DILocation(line: 1153, column: 13, scope: !1000)
!1240 = !DILocation(line: 1156, column: 6, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1000, file: !2, line: 1156, column: 6)
!1242 = !DILocation(line: 1156, column: 6, scope: !1000)
!1243 = !DILocation(line: 1157, column: 11, scope: !1241)
!1244 = !DILocation(line: 1159, column: 11, scope: !1241)
!1245 = !DILocation(line: 1159, column: 4, scope: !1241)
!1246 = !DILocation(line: 1159, column: 39, scope: !1241)
!1247 = !DILocation(line: 1159, column: 19, scope: !1241)
!1248 = !DILocation(line: 1157, column: 3, scope: !1241)
!1249 = !DILocation(line: 1161, column: 10, scope: !1000)
!1250 = !DILocation(line: 1161, column: 14, scope: !1000)
!1251 = !DILocation(line: 1161, column: 19, scope: !1000)
!1252 = !DILocation(line: 1161, column: 22, scope: !1000)
!1253 = !DILocation(line: 1161, column: 36, scope: !1000)
!1254 = !DILocation(line: 1161, column: 39, scope: !1000)
!1255 = !DILocation(line: 1161, column: 50, scope: !1000)
!1256 = !DILocation(line: 1161, column: 2, scope: !1000)
!1257 = !DILocation(line: 1162, column: 1, scope: !1000)
!1258 = !DISubprogram(name: "geteuid", scope: !1259, file: !1259, line: 700, type: !1260, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !962)
!1259 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!1262}
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !139, line: 146, baseType: !39)
!1263 = !DISubprogram(name: "printf", scope: !304, file: !304, line: 356, type: !1264, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1266)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!312, !379, null}
!1266 = !{!1267}
!1267 = !DILocalVariable(name: "__format", arg: 1, scope: !1263, file: !304, line: 356, type: !379)
!1268 = distinct !DISubprogram(name: "set_rlimit", scope: !2, file: !2, line: 313, type: !1269, scopeLine: 314, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !1271)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!312, !334}
!1271 = !{!1272, !1273}
!1272 = !DILocalVariable(name: "lim", arg: 1, scope: !1268, file: !2, line: 313, type: !334)
!1273 = !DILocalVariable(name: "rlim", scope: !1268, file: !2, line: 315, type: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rlimit", file: !76, line: 139, size: 128, elements: !1275)
!1275 = !{!1276, !1278}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_cur", scope: !1274, file: !76, line: 142, baseType: !1277, size: 64)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlim_t", file: !76, line: 131, baseType: !138)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_max", scope: !1274, file: !76, line: 144, baseType: !1277, size: 64, offset: 64)
!1279 = !DILocation(line: 313, column: 32, scope: !1268)
!1280 = !DILocation(line: 315, column: 2, scope: !1268)
!1281 = !DILocation(line: 315, column: 16, scope: !1268)
!1282 = !DILocation(line: 315, column: 23, scope: !1268)
!1283 = !DILocation(line: 316, column: 15, scope: !1268)
