; ModuleID = 'pping.c'
source_filename = "pping.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.pping_config = type { %struct.bpf_config, %struct.bpf_tc_opts, %struct.bpf_tc_opts, i64, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i32, i32, [16 x i8], i32, i8, i8 }
%struct.bpf_config = type { i64, i64, i8, i8, i8, i8, i32 }
%struct.bpf_tc_opts = type { i64, i32, i32, i32, i32, i32 }
%struct.rlimit = type { i64, i64 }
%struct.rtt_event = type { i64, i64, %struct.network_tuple, i32, i64, i64, i64, i64, i64, i64, i8, [7 x i8] }
%struct.network_tuple = type { %struct.flow_address, %struct.flow_address, i16, i8, i8 }
%struct.flow_address = type { %struct.in6_addr, i16, i16 }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.flow_event = type { i64, i64, %struct.network_tuple, i8, i8, i8, i8 }
%struct.map_cleanup_args = type { i64, i32, i32 }
%struct.bpf_tc_hook = type { i64, i32, i32, i32 }
%struct.timespec = type { i64, i64 }
%struct.flow_state = type { i64, i64, i64, i64, i64, i64, i64, i32, i8, i8, i16 }
%struct.map_full_event = type { i64, i64, %struct.network_tuple, i8, [3 x i8] }

@.str = private unnamed_addr constant [10 x i8] c"TCP, ICMP\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [4 x i8] c"TCP\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [5 x i8] c"ICMP\00", align 1, !dbg !12

!72 = !DIEnumerator(name: "BPF_TC_INGRESS", value: 1)
!73 = !DIEnumerator(name: "BPF_TC_EGRESS", value: 2)
!74 = !DIEnumerator(name: "BPF_TC_CUSTOM", value: 4)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rlimit_resource", file: !76, line: 31, baseType: !39, size: 32, elements: !77)
!76 = !DIFile(filename: "/usr/include/bits/resource.h", directory: "", checksumkind: CSK_MD5, checksum: "bb0bdc9e7ae341ef435e98e05276a863")
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!78 = !DIEnumerator(name: "RLIMIT_CPU", value: 0)
!79 = !DIEnumerator(name: "RLIMIT_FSIZE", value: 1)
!80 = !DIEnumerator(name: "RLIMIT_DATA", value: 2)
!81 = !DIEnumerator(name: "RLIMIT_STACK", value: 3)
!82 = !DIEnumerator(name: "RLIMIT_CORE", value: 4)
!83 = !DIEnumerator(name: "__RLIMIT_RSS", value: 5)
!84 = !DIEnumerator(name: "RLIMIT_NOFILE", value: 7)
!85 = !DIEnumerator(name: "__RLIMIT_OFILE", value: 7)
!86 = !DIEnumerator(name: "RLIMIT_AS", value: 9)
!87 = !DIEnumerator(name: "__RLIMIT_NPROC", value: 6)
!88 = !DIEnumerator(name: "__RLIMIT_MEMLOCK", value: 8)
!89 = !DIEnumerator(name: "__RLIMIT_LOCKS", value: 10)
!90 = !DIEnumerator(name: "__RLIMIT_SIGPENDING", value: 11)
!91 = !DIEnumerator(name: "__RLIMIT_MSGQUEUE", value: 12)
!92 = !DIEnumerator(name: "__RLIMIT_NICE", value: 13)
!93 = !DIEnumerator(name: "__RLIMIT_RTPRIO", value: 14)
!94 = !DIEnumerator(name: "__RLIMIT_RTTIME", value: 15)
!95 = !DIEnumerator(name: "__RLIMIT_NLIMITS", value: 16)
!96 = !DIEnumerator(name: "__RLIM_NLIMITS", value: 16)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 40, baseType: !39, size: 32, elements: !99)
!98 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!100 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!101 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!102 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!103 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!104 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!105 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!106 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!107 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!108 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!109 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!110 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!111 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!112 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!113 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!114 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!115 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!116 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!117 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!118 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!119 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!120 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!121 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!122 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!123 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!124 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!125 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!126 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!127 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 103, baseType: !39, size: 32, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135, !136}
!130 = !DIEnumerator(name: "IPPROTO_HOPOPTS", value: 0)
!131 = !DIEnumerator(name: "IPPROTO_ROUTING", value: 43)
!132 = !DIEnumerator(name: "IPPROTO_FRAGMENT", value: 44)
!133 = !DIEnumerator(name: "IPPROTO_ICMPV6", value: 58)
!134 = !DIEnumerator(name: "IPPROTO_NONE", value: 59)
!135 = !DIEnumerator(name: "IPPROTO_DSTOPTS", value: 60)
!136 = !DIEnumerator(name: "IPPROTO_MH", value: 135)
!137 = !{!138, !141, !142, !143, !146, !148, !149}
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__rlim_t", file: !139, line: 157, baseType: !140)
!139 = !DIFile(filename: "/usr/include/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!140 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixpoint64", file: !45, line: 9, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !144, line: 31, baseType: !145)
!144 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!145 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !139, line: 40, baseType: !147)
!147 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "pping_event", file: !45, line: 154, size: 960, elements: !151)
!151 = !{!152, !153, !208, !218}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !150, file: !45, line: 155, baseType: !143, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "rtt_event", scope: !150, file: !45, line: 156, baseType: !154, size: 960)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtt_event", file: !45, line: 114, size: 960, elements: !155)
!155 = !{!156, !157, !158, !194, !196, !197, !198, !199, !200, !201, !202, !204}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !154, file: !45, line: 115, baseType: !143, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !154, file: !45, line: 116, baseType: !143, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !154, file: !45, line: 117, baseType: !159, size: 352, offset: 128)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "network_tuple", file: !45, line: 74, size: 352, elements: !160)
!160 = !{!161, !189, !190, !191, !193}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !159, file: !45, line: 75, baseType: !162, size: 160)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_address", file: !45, line: 61, size: 160, elements: !163)
!163 = !{!164, !186, !188}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !162, file: !45, line: 62, baseType: !165, size: 128)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !98, line: 219, size: 128, elements: !166)
!166 = !{!167}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !165, file: !98, line: 226, baseType: !168, size: 128)
!168 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !165, file: !98, line: 221, size: 128, elements: !169)
!169 = !{!170, !177, !182}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !168, file: !98, line: 223, baseType: !171, size: 128)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 128, elements: !175)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !173, line: 24, baseType: !174)
!173 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !139, line: 38, baseType: !46)
!175 = !{!176}
!176 = !DISubrange(count: 16)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !168, file: !98, line: 224, baseType: !178, size: 128)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 128, elements: !180)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !173, line: 25, baseType: !146)
!180 = !{!181}
!181 = !DISubrange(count: 8)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !168, file: !98, line: 225, baseType: !183, size: 128)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 128, elements: !10)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !173, line: 26, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !139, line: 42, baseType: !39)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !162, file: !45, line: 63, baseType: !187, size: 16, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !144, line: 24, baseType: !147)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !162, file: !45, line: 64, baseType: !187, size: 16, offset: 144)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !159, file: !45, line: 76, baseType: !162, size: 160, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !159, file: !45, line: 77, baseType: !187, size: 16, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ipv", scope: !159, file: !45, line: 78, baseType: !192, size: 8, offset: 336)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !144, line: 21, baseType: !46)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !159, file: !45, line: 79, baseType: !192, size: 8, offset: 344)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !154, file: !45, line: 118, baseType: !195, size: 32, offset: 480)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !144, line: 27, baseType: !39)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "rtt", scope: !154, file: !45, line: 119, baseType: !143, size: 64, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "min_rtt", scope: !154, file: !45, line: 120, baseType: !143, size: 64, offset: 576)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sent_pkts", scope: !154, file: !45, line: 121, baseType: !143, size: 64, offset: 640)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bytes", scope: !154, file: !45, line: 122, baseType: !143, size: 64, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "rec_pkts", scope: !154, file: !45, line: 123, baseType: !143, size: 64, offset: 768)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "rec_bytes", scope: !154, file: !45, line: 124, baseType: !143, size: 64, offset: 832)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "match_on_egress", scope: !154, file: !45, line: 125, baseType: !203, size: 8, offset: 896)
!203 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !154, file: !45, line: 126, baseType: !205, size: 56, offset: 904)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 56, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 7)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flow_event", scope: !150, file: !45, line: 157, baseType: !209, size: 512)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_event", file: !45, line: 132, size: 512, elements: !210)
!210 = !{!211, !212, !213, !214, !215, !216, !217}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !209, file: !45, line: 133, baseType: !143, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !209, file: !45, line: 134, baseType: !143, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !209, file: !45, line: 135, baseType: !159, size: 352, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "flow_event_type", scope: !209, file: !45, line: 136, baseType: !44, size: 8, offset: 480)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !209, file: !45, line: 137, baseType: !52, size: 8, offset: 488)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !209, file: !45, line: 138, baseType: !60, size: 8, offset: 496)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !209, file: !45, line: 139, baseType: !192, size: 8, offset: 504)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "map_event", scope: !150, file: !45, line: 158, baseType: !219, size: 512)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "map_full_event", file: !45, line: 146, size: 512, elements: !220)
!220 = !{!221, !222, !223, !224, !225}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !219, file: !45, line: 147, baseType: !143, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !219, file: !45, line: 148, baseType: !143, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !219, file: !45, line: 149, baseType: !159, size: 352, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !219, file: !45, line: 150, baseType: !65, size: 8, offset: 480)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !219, file: !45, line: 151, baseType: !226, size: 24, offset: 488)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 24, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 3)
!229 = !{!0, !7, !12, !17, !22, !24, !29, !230, !235, !240, !243, !245, !250, !253, !258, !263, !268, !273, !278, !283, !288, !290, !292, !297, !302, !365, !367, !369, !372, !34, !374, !386, !388, !393, !398, !400, !402, !404, !406, !408, !413, !415, !417, !420, !422, !424, !426, !431, !436, !438, !440, !442, !444, !446, !448, !450, !452, !454, !466, !471, !476, !478, !483, !488, !490, !492, !497, !499, !504, !506, !508, !510, !515, !517, !519, !528, !530, !538, !540, !542, !547, !549, !551, !553, !555, !557, !559, !564, !566, !568, !570, !572, !574, !576, !583, !585, !587, !589, !591, !593, !595, !597, !599, !601, !603, !605, !607, !609, !611, !613, !615, !620, !622, !627, !632, !637, !642, !644, !646, !651, !653, !655, !660, !665, !670, !675, !677, !679, !684}
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1033, type: !232, isLocal: true, isDefinition: true)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 13)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1034, type: !237, isLocal: true, isDefinition: true)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 18)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1035, type: !242, isLocal: true, isDefinition: true)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !175)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1036, type: !3, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1037, type: !247, isLocal: true, isDefinition: true)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 11)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1038, type: !252, isLocal: true, isDefinition: true)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !206)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1047, type: !255, isLocal: true, isDefinition: true)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 35)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1054, type: !260, isLocal: true, isDefinition: true)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 38)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1061, type: !265, isLocal: true, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 31)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1073, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 776, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 97)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1087, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 46)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1094, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 49)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1101, type: !285, isLocal: true, isDefinition: true)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 36)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1113, type: !255, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1127, type: !265, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1150, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 440, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 55)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1158, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 54)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "stdin", scope: !36, file: !304, line: 143, type: !305, isLocal: false, isDefinition: false)
!304 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !307, line: 7, baseType: !308)
!307 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !309, line: 49, size: 1728, elements: !310)
!309 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!310 = !{!311, !313, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !328, !330, !331, !332, !335, !336, !338, !342, !345, !349, !352, !355, !356, !357, !360, !361}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !308, file: !309, line: 51, baseType: !312, size: 32)
!312 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !308, file: !309, line: 54, baseType: !314, size: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !308, file: !309, line: 55, baseType: !314, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !308, file: !309, line: 56, baseType: !314, size: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !308, file: !309, line: 57, baseType: !314, size: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !308, file: !309, line: 58, baseType: !314, size: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !308, file: !309, line: 59, baseType: !314, size: 64, offset: 384)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !308, file: !309, line: 60, baseType: !314, size: 64, offset: 448)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !308, file: !309, line: 61, baseType: !314, size: 64, offset: 512)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !308, file: !309, line: 64, baseType: !314, size: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !308, file: !309, line: 65, baseType: !314, size: 64, offset: 640)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !308, file: !309, line: 66, baseType: !314, size: 64, offset: 704)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !308, file: !309, line: 68, baseType: !326, size: 64, offset: 768)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !309, line: 36, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !308, file: !309, line: 70, baseType: !329, size: 64, offset: 832)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !308, file: !309, line: 72, baseType: !312, size: 32, offset: 896)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !308, file: !309, line: 73, baseType: !312, size: 32, offset: 928)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !308, file: !309, line: 74, baseType: !333, size: 64, offset: 960)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !139, line: 152, baseType: !334)
!334 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !308, file: !309, line: 77, baseType: !147, size: 16, offset: 1024)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !308, file: !309, line: 78, baseType: !337, size: 8, offset: 1040)
!337 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !308, file: !309, line: 79, baseType: !339, size: 8, offset: 1048)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 1)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !308, file: !309, line: 81, baseType: !343, size: 64, offset: 1088)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !309, line: 43, baseType: null)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !308, file: !309, line: 89, baseType: !346, size: 64, offset: 1152)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !139, line: 153, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !139, line: 47, baseType: !348)
!348 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !308, file: !309, line: 91, baseType: !350, size: 64, offset: 1216)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !309, line: 37, flags: DIFlagFwdDecl)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !308, file: !309, line: 92, baseType: !353, size: 64, offset: 1280)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !309, line: 38, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !308, file: !309, line: 93, baseType: !329, size: 64, offset: 1344)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !308, file: !309, line: 94, baseType: !141, size: 64, offset: 1408)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !308, file: !309, line: 95, baseType: !358, size: 64, offset: 1472)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !359, line: 46, baseType: !140)
!359 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/demo", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !308, file: !309, line: 96, baseType: !312, size: 32, offset: 1536)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !308, file: !309, line: 98, baseType: !362, size: 160, offset: 1568)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 20)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "stdout", scope: !36, file: !304, line: 144, type: !305, isLocal: false, isDefinition: false)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "stderr", scope: !36, file: !304, line: 145, type: !305, isLocal: false, isDefinition: false)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "optarg", scope: !36, file: !371, line: 36, type: !314, isLocal: false, isDefinition: false)
!371 = !DIFile(filename: "/usr/include/bits/getopt_core.h", directory: "", checksumkind: CSK_MD5, checksum: "81ab788980ce9d5be2ba931a6ae17301")
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "optind", scope: !36, file: !371, line: 50, type: !312, isLocal: false, isDefinition: false)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "buf", scope: !376, file: !2, line: 145, type: !383, isLocal: true, isDefinition: true)
!376 = distinct !DISubprogram(name: "get_libbpf_strerror", scope: !2, file: !2, line: 143, type: !377, scopeLine: 144, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !381)
!377 = !DISubroutineType(types: !378)
!378 = !{!379, !312}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!381 = !{!382}
!382 = !DILocalVariable(name: "err", arg: 1, scope: !376, file: !2, line: 143, type: !312)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1600, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 200)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !2, line: 178, type: !362, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !2, line: 183, type: !390, isLocal: true, isDefinition: true)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 25)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(scope: null, file: !2, line: 192, type: !395, isLocal: true, isDefinition: true)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 41)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !2, line: 200, type: !247, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !2, line: 209, type: !19, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !2, line: 216, type: !9, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !2, line: 219, type: !19, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !2, line: 223, type: !260, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !2, line: 230, type: !410, isLocal: true, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 17)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !2, line: 245, type: !275, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !2, line: 250, type: !9, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !2, line: 252, type: !419, isLocal: true, isDefinition: true)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !227)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !2, line: 253, type: !410, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !2, line: 255, type: !285, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !2, line: 273, type: !252, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !2, line: 277, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 19)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !2, line: 284, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 51)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !2, line: 97, type: !14, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !2, line: 98, type: !3, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !2, line: 101, type: !19, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !2, line: 102, type: !26, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !2, line: 104, type: !252, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !2, line: 105, type: !232, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !2, line: 106, type: !9, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !2, line: 107, type: !14, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !2, line: 108, type: !31, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "long_options", scope: !36, file: !2, line: 96, type: !456, isLocal: true, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 3328, elements: !233)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !459, line: 50, size: 256, elements: !460)
!459 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!460 = !{!461, !462, !463, !465}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !458, file: !459, line: 52, baseType: !379, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !458, file: !459, line: 55, baseType: !312, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !458, file: !459, line: 56, baseType: !464, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !458, file: !459, line: 57, baseType: !312, size: 32, offset: 192)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !2, line: 156, type: !468, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 29)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !2, line: 160, type: !473, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 27)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !2, line: 119, type: !362, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !2, line: 120, type: !480, isLocal: true, isDefinition: true)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 2)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !2, line: 121, type: !485, isLocal: true, isDefinition: true)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: 32)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(scope: null, file: !2, line: 122, type: !428, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !2, line: 124, type: !19, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(scope: null, file: !2, line: 126, type: !494, isLocal: true, isDefinition: true)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 26)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !2, line: 129, type: !428, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 59)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "__doc__", scope: !36, file: !2, line: 2, type: !379, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !2, line: 729, type: !255, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !2, line: 739, type: !14, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !2, line: 741, type: !512, isLocal: true, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 23)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !2, line: 721, type: !19, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !2, line: 722, type: !3, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "offset", scope: !521, file: !2, line: 604, type: !143, isLocal: true, isDefinition: true)
!521 = distinct !DISubprogram(name: "convert_monotonic_to_realtime", scope: !2, file: !2, line: 602, type: !522, scopeLine: 603, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !524)
!522 = !DISubroutineType(types: !523)
!523 = !{!143, !143}
!524 = !{!525, !526, !527}
!525 = !DILocalVariable(name: "monotonic_time", arg: 1, scope: !521, file: !2, line: 602, type: !143)
!526 = !DILocalVariable(name: "now_mon", scope: !521, file: !2, line: 606, type: !143)
!527 = !DILocalVariable(name: "now_rt", scope: !521, file: !2, line: 607, type: !143)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "offset_updated", scope: !521, file: !2, line: 605, type: !143, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "buf", scope: !532, file: !2, line: 640, type: !537, isLocal: true, isDefinition: true)
!532 = distinct !DISubprogram(name: "proto_to_str", scope: !2, file: !2, line: 638, type: !533, scopeLine: 639, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !535)
!533 = !DISubroutineType(types: !534)
!534 = !{!379, !187}
!535 = !{!536}
!536 = !DILocalVariable(name: "proto", arg: 1, scope: !532, file: !2, line: 638, type: !187)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !180)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !2, line: 648, type: !252, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !2, line: 650, type: !419, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !2, line: 711, type: !544, isLocal: true, isDefinition: true)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 12)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(scope: null, file: !2, line: 659, type: !14, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !2, line: 661, type: !537, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !2, line: 664, type: !537, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !2, line: 666, type: !537, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !2, line: 674, type: !9, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !2, line: 676, type: !537, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !2, line: 678, type: !561, isLocal: true, isDefinition: true)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 22)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !2, line: 680, type: !9, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !2, line: 682, type: !9, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !2, line: 684, type: !232, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !2, line: 694, type: !9, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !2, line: 696, type: !14, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !2, line: 698, type: !237, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "print_event_func", scope: !36, file: !2, line: 94, type: !578, isLocal: true, isDefinition: true)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !2, line: 774, type: !3, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !2, line: 776, type: !252, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !2, line: 777, type: !19, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !2, line: 778, type: !537, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !2, line: 779, type: !3, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !2, line: 780, type: !19, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !2, line: 786, type: !9, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !2, line: 787, type: !537, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !2, line: 788, type: !232, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !2, line: 789, type: !247, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !2, line: 790, type: !544, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !2, line: 791, type: !3, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !2, line: 792, type: !242, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !2, line: 798, type: !247, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !2, line: 800, type: !252, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !2, line: 802, type: !232, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !2, line: 757, type: !617, isLocal: true, isDefinition: true)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 37)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !2, line: 910, type: !255, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !2, line: 918, type: !624, isLocal: true, isDefinition: true)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 44)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !2, line: 926, type: !629, isLocal: true, isDefinition: true)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 39)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !2, line: 938, type: !634, isLocal: true, isDefinition: true)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 57)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !2, line: 956, type: !639, isLocal: true, isDefinition: true)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 58)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !2, line: 971, type: !395, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !2, line: 327, type: !537, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !2, line: 892, type: !648, isLocal: true, isDefinition: true)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 64)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !2, line: 896, type: !485, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !2, line: 986, type: !265, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !2, line: 993, type: !657, isLocal: true, isDefinition: true)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 45)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1011, type: !662, isLocal: true, isDefinition: true)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 60)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !2, line: 574, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 552, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 69)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !2, line: 849, type: !672, isLocal: true, isDefinition: true)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 34)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !2, line: 827, type: !275, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !2, line: 828, type: !14, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !2, line: 856, type: !681, isLocal: true, isDefinition: true)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 28)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "json_ctx", scope: !36, file: !2, line: 93, type: !686, isLocal: true, isDefinition: true)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_writer_t", file: !688, line: 21, baseType: !689)
!688 = !DIFile(filename: "../lib/util/json_writer.h", directory: "/home/demo/bpf-examples/pping", checksumkind: CSK_MD5, checksum: "a3d1c9d40d0b039d45a7ff575e542b45")
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "json_writer", file: !688, line: 21, flags: DIFlagFwdDecl)
!690 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !312)
!691 = !{i32 7, !"Dwarf Version", i32 5}
!692 = !{i32 2, !"Debug Info Version", i32 3}
!693 = !{i32 1, !"wchar_size", i32 4}
!694 = !{i32 7, !"frame-pointer", i32 2}
!695 = !{!"clang version 16.0.0"}
!696 = distinct !DISubprogram(name: "tracked_protocols_to_str", scope: !2, file: !2, line: 291, type: !697, scopeLine: 292, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !737)
!697 = !DISubroutineType(types: !698)
!698 = !{!379, !699}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pping_config", file: !2, line: 71, size: 1472, elements: !701)
!701 = !{!702, !712, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "bpf_config", scope: !700, file: !2, line: 72, baseType: !703, size: 192)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_config", file: !45, line: 46, size: 192, elements: !704)
!704 = !{!705, !706, !707, !708, !709, !710, !711}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "rate_limit", scope: !703, file: !45, line: 47, baseType: !143, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "rtt_rate", scope: !703, file: !45, line: 48, baseType: !142, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "use_srtt", scope: !703, file: !45, line: 49, baseType: !203, size: 8, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "track_tcp", scope: !703, file: !45, line: 50, baseType: !203, size: 8, offset: 136)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "track_icmp", scope: !703, file: !45, line: 51, baseType: !203, size: 8, offset: 144)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "localfilt", scope: !703, file: !45, line: 52, baseType: !203, size: 8, offset: 152)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !703, file: !45, line: 53, baseType: !195, size: 32, offset: 160)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "tc_ingress_opts", scope: !700, file: !2, line: 73, baseType: !713, size: 256, offset: 192)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_tc_opts", file: !70, line: 866, size: 256, elements: !714)
!714 = !{!715, !716, !717, !718, !719, !720}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !713, file: !70, line: 867, baseType: !358, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "prog_fd", scope: !713, file: !70, line: 868, baseType: !312, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !713, file: !70, line: 869, baseType: !195, size: 32, offset: 96)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "prog_id", scope: !713, file: !70, line: 870, baseType: !195, size: 32, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !713, file: !70, line: 871, baseType: !195, size: 32, offset: 160)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !713, file: !70, line: 872, baseType: !195, size: 32, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "tc_egress_opts", scope: !700, file: !2, line: 74, baseType: !713, size: 256, offset: 448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_interval", scope: !700, file: !2, line: 75, baseType: !143, size: 64, offset: 704)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "object_path", scope: !700, file: !2, line: 76, baseType: !314, size: 64, offset: 768)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_prog", scope: !700, file: !2, line: 77, baseType: !314, size: 64, offset: 832)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "egress_prog", scope: !700, file: !2, line: 78, baseType: !314, size: 64, offset: 896)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "packet_map", scope: !700, file: !2, line: 79, baseType: !314, size: 64, offset: 960)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "flow_map", scope: !700, file: !2, line: 80, baseType: !314, size: 64, offset: 1024)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "event_map", scope: !700, file: !2, line: 81, baseType: !314, size: 64, offset: 1088)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "xdp_flags", scope: !700, file: !2, line: 82, baseType: !312, size: 32, offset: 1152)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !700, file: !2, line: 83, baseType: !312, size: 32, offset: 1184)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_prog_id", scope: !700, file: !2, line: 84, baseType: !312, size: 32, offset: 1216)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "egress_prog_id", scope: !700, file: !2, line: 85, baseType: !312, size: 32, offset: 1248)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !700, file: !2, line: 86, baseType: !242, size: 128, offset: 1280)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "output_format", scope: !700, file: !2, line: 87, baseType: !38, size: 32, offset: 1408)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "force", scope: !700, file: !2, line: 88, baseType: !203, size: 8, offset: 1440)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "created_tc_hook", scope: !700, file: !2, line: 89, baseType: !203, size: 8, offset: 1448)
!737 = !{!738, !739, !740}
!738 = !DILocalVariable(name: "config", arg: 1, scope: !696, file: !2, line: 291, type: !699)
!739 = !DILocalVariable(name: "tcp", scope: !696, file: !2, line: 293, type: !203)
!740 = !DILocalVariable(name: "icmp", scope: !696, file: !2, line: 294, type: !203)
!741 = !{!742, !742, i64 0}
!742 = !{!"any pointer", !743, i64 0}
!743 = !{!"omnipotent char", !744, i64 0}
!744 = !{!"Simple C/C++ TBAA"}
!745 = !DILocation(line: 291, column: 59, scope: !696)
!746 = !DILocation(line: 293, column: 2, scope: !696)
!747 = !DILocation(line: 293, column: 7, scope: !696)
!748 = !DILocation(line: 293, column: 13, scope: !696)
!749 = !DILocation(line: 293, column: 21, scope: !696)
!750 = !DILocation(line: 293, column: 32, scope: !696)
!751 = !{!752, !755, i64 17}
!752 = !{!"pping_config", !753, i64 0, !757, i64 24, !757, i64 56, !754, i64 88, !742, i64 96, !742, i64 104, !742, i64 112, !742, i64 120, !742, i64 128, !742, i64 136, !756, i64 144, !756, i64 148, !756, i64 152, !756, i64 156, !743, i64 160, !743, i64 176, !755, i64 180, !755, i64 181}
!753 = !{!"bpf_config", !754, i64 0, !754, i64 8, !755, i64 16, !755, i64 17, !755, i64 18, !755, i64 19, !756, i64 20}
!754 = !{!"long long", !743, i64 0}
!755 = !{!"_Bool", !743, i64 0}
!756 = !{!"int", !743, i64 0}
!757 = !{!"bpf_tc_opts", !758, i64 0, !756, i64 8, !756, i64 12, !756, i64 16, !756, i64 20, !756, i64 24}
!758 = !{!"long", !743, i64 0}
!759 = !{i8 0, i8 2}
!760 = !{}
!761 = !{!755, !755, i64 0}
!762 = !DILocation(line: 294, column: 2, scope: !696)
!763 = !DILocation(line: 294, column: 7, scope: !696)
!764 = !DILocation(line: 294, column: 14, scope: !696)
!765 = !DILocation(line: 294, column: 22, scope: !696)
!766 = !DILocation(line: 294, column: 33, scope: !696)
!767 = !{!752, !755, i64 18}
!768 = !DILocation(line: 295, column: 9, scope: !696)
!769 = !DILocation(line: 295, column: 13, scope: !696)
!770 = !DILocation(line: 295, column: 16, scope: !696)
!771 = !DILocation(line: 295, column: 37, scope: !696)
!772 = !DILocation(line: 296, column: 1, scope: !696)
!773 = !DILocation(line: 295, column: 2, scope: !696)
!774 = distinct !DISubprogram(name: "output_format_to_str", scope: !2, file: !2, line: 298, type: !775, scopeLine: 299, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !777)
!775 = !DISubroutineType(types: !776)
!776 = !{!379, !38}
!777 = !{!778}
!778 = !DILocalVariable(name: "format", arg: 1, scope: !774, file: !2, line: 298, type: !38)
!779 = !{!743, !743, i64 0}
!780 = !DILocation(line: 298, column: 59, scope: !774)
!781 = !DILocation(line: 300, column: 10, scope: !774)
!782 = !DILocation(line: 300, column: 2, scope: !774)
!783 = !DILocation(line: 301, column: 30, scope: !784)
!784 = distinct !DILexicalBlock(scope: !774, file: !2, line: 300, column: 18)
!785 = !DILocation(line: 302, column: 26, scope: !784)
!786 = !DILocation(line: 303, column: 27, scope: !784)
!787 = !DILocation(line: 304, column: 11, scope: !784)
!788 = !DILocation(line: 306, column: 1, scope: !774)
!789 = distinct !DISubprogram(name: "abort_program", scope: !2, file: !2, line: 308, type: !790, scopeLine: 309, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !792)
!790 = !DISubroutineType(types: !791)
!791 = !{null, !312}
!792 = !{!793}
!793 = !DILocalVariable(name: "sig", arg: 1, scope: !789, file: !2, line: 308, type: !312)
!794 = !{!756, !756, i64 0}
!795 = !DILocation(line: 308, column: 24, scope: !789)
!796 = !DILocation(line: 310, column: 15, scope: !789)
!797 = !DILocation(line: 311, column: 1, scope: !789)
!798 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 1019, type: !799, scopeLine: 1020, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !802)
!799 = !DISubroutineType(types: !800)
!800 = !{!312, !312, !801}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!802 = !{!803, !804, !805, !806, !807, !810, !813, !814, !815, !816}
!803 = !DILocalVariable(name: "argc", arg: 1, scope: !798, file: !2, line: 1019, type: !312)
!804 = !DILocalVariable(name: "argv", arg: 2, scope: !798, file: !2, line: 1019, type: !801)
!805 = !DILocalVariable(name: "err", scope: !798, file: !2, line: 1021, type: !312)
!806 = !DILocalVariable(name: "detach_err", scope: !798, file: !2, line: 1021, type: !312)
!807 = !DILocalVariable(name: "obj", scope: !798, file: !2, line: 1022, type: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_object", file: !70, line: 66, flags: DIFlagFwdDecl)
!810 = !DILocalVariable(name: "pb", scope: !798, file: !2, line: 1023, type: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "perf_buffer", file: !70, line: 908, flags: DIFlagFwdDecl)
!813 = !DILocalVariable(name: "tc_ingress_opts", scope: !798, file: !2, line: 1025, type: !713)
!814 = !DILocalVariable(name: "tc_egress_opts", scope: !798, file: !2, line: 1026, type: !713)
!815 = !DILocalVariable(name: "config", scope: !798, file: !2, line: 1028, type: !700)
!816 = !DILabel(scope: !798, name: "cleanup_attached_progs", file: !2, line: 1141)
!817 = !DILocation(line: 1019, column: 14, scope: !798)
!818 = !DILocation(line: 1019, column: 26, scope: !798)
!819 = !DILocation(line: 1021, column: 2, scope: !798)
!820 = !DILocation(line: 1021, column: 6, scope: !798)
!821 = !DILocation(line: 1021, column: 15, scope: !798)
!822 = !DILocation(line: 1022, column: 2, scope: !798)
!823 = !DILocation(line: 1022, column: 21, scope: !798)
!824 = !DILocation(line: 1023, column: 2, scope: !798)
!825 = !DILocation(line: 1023, column: 22, scope: !798)
!826 = !DILocation(line: 1025, column: 2, scope: !798)
!827 = !DILocation(line: 1025, column: 2, scope: !828)
!828 = distinct !DILexicalBlock(scope: !798, file: !2, line: 1025, column: 2)
!829 = !{!757, !758, i64 0}
!830 = !DILocation(line: 1026, column: 2, scope: !798)
!831 = !DILocation(line: 1026, column: 2, scope: !832)
!832 = distinct !DILexicalBlock(scope: !798, file: !2, line: 1026, column: 2)
!833 = !DILocation(line: 1028, column: 2, scope: !798)
!834 = !DILocation(line: 1028, column: 22, scope: !798)
!835 = !DILocation(line: 1028, column: 31, scope: !798)
!836 = !DILocation(line: 1029, column: 17, scope: !798)
!837 = !{!753, !754, i64 0}
!838 = !{!753, !754, i64 8}
!839 = !{!753, !755, i64 16}
!840 = !{!753, !755, i64 17}
!841 = !{!753, !755, i64 18}
!842 = !{!753, !755, i64 19}
!843 = !{!753, !756, i64 20}
!844 = !DILocation(line: 1040, column: 22, scope: !798)
!845 = !{i64 0, i64 8, !846, i64 8, i64 4, !794, i64 12, i64 4, !794, i64 16, i64 4, !794, i64 20, i64 4, !794, i64 24, i64 4, !794}
!846 = !{!758, !758, i64 0}
!847 = !DILocation(line: 1041, column: 21, scope: !798)
!848 = !{!752, !754, i64 88}
!849 = !{!752, !742, i64 96}
!850 = !{!752, !742, i64 104}
!851 = !{!752, !742, i64 112}
!852 = !{!752, !742, i64 120}
!853 = !{!752, !742, i64 128}
!854 = !{!752, !742, i64 136}
!855 = !{!752, !756, i64 144}
!856 = !{!752, !756, i64 148}
!857 = !{!752, !756, i64 152}
!858 = !{!752, !756, i64 156}
!859 = !{!752, !743, i64 176}
!860 = !{!752, !755, i64 180}
!861 = !{!752, !755, i64 181}
!862 = !DILocation(line: 1046, column: 6, scope: !863)
!863 = distinct !DILexicalBlock(scope: !798, file: !2, line: 1046, column: 6)
!864 = !DILocation(line: 1046, column: 16, scope: !863)
!865 = !DILocation(line: 1046, column: 6, scope: !798)
!866 = !DILocation(line: 1047, column: 3, scope: !867)
!867 = distinct !DILexicalBlock(scope: !863, file: !2, line: 1046, column: 22)
!868 = !DILocation(line: 1048, column: 3, scope: !867)
!869 = !DILocation(line: 1052, column: 8, scope: !798)
!870 = !DILocation(line: 1052, column: 6, scope: !798)
!871 = !DILocation(line: 1053, column: 6, scope: !872)
!872 = distinct !DILexicalBlock(scope: !798, file: !2, line: 1053, column: 6)
!873 = !DILocation(line: 1053, column: 6, scope: !798)
!874 = !DILocation(line: 1054, column: 11, scope: !875)
!875 = distinct !DILexicalBlock(scope: !872, file: !2, line: 1053, column: 11)
!876 = !DILocation(line: 1055, column: 24, scope: !875)
!877 = !DILocation(line: 1055, column: 4, scope: !875)
!878 = !DILocation(line: 1054, column: 3, scope: !875)
!879 = !DILocation(line: 1056, column: 3, scope: !875)
!880 = !DILocation(line: 1059, column: 24, scope: !798)
!881 = !DILocation(line: 1059, column: 30, scope: !798)
!882 = !DILocation(line: 1059, column: 8, scope: !798)
!883 = !DILocation(line: 1059, column: 6, scope: !798)
!884 = !DILocation(line: 1060, column: 6, scope: !885)
!885 = distinct !DILexicalBlock(scope: !798, file: !2, line: 1060, column: 6)
!886 = !DILocation(line: 1060, column: 6, scope: !798)
!887 = !DILocation(line: 1061, column: 11, scope: !888)
!888 = distinct !DILexicalBlock(scope: !885, file: !2, line: 1060, column: 11)
!889 = !DILocation(line: 1062, column: 24, scope: !888)
!890 = !DILocation(line: 1062, column: 4, scope: !888)
!891 = !DILocation(line: 1061, column: 3, scope: !888)
!892 = !DILocation(line: 1063, column: 15, scope: !888)
!893 = !DILocation(line: 1063, column: 3, scope: !888)
!894 = !DILocation(line: 1064, column: 3, scope: !888)
!895 = !DILocation(line: 1067, column: 14, scope: !896)
!896 = distinct !DILexicalBlock(scope: !798, file: !2, line: 1067, column: 6)
!897 = !DILocation(line: 1067, column: 25, scope: !896)
!898 = !DILocation(line: 1067, column: 35, scope: !896)
!899 = !DILocation(line: 1067, column: 46, scope: !896)
!900 = !DILocation(line: 1067, column: 57, scope: !896)
!901 = !DILocation(line: 1067, column: 6, scope: !798)
!902 = !DILocation(line: 1068, column: 10, scope: !896)
!903 = !DILocation(line: 1068, column: 21, scope: !896)
!904 = !DILocation(line: 1068, column: 31, scope: !896)
!905 = !DILocation(line: 1068, column: 3, scope: !896)
!906 = !DILocation(line: 1070, column: 13, scope: !907)
!907 = distinct !DILexicalBlock(scope: !798, file: !2, line: 1070, column: 6)
!908 = !DILocation(line: 1070, column: 24, scope: !907)
!909 = !DILocation(line: 1070, column: 35, scope: !907)
!910 = !DILocation(line: 1071, column: 13, scope: !907)
!911 = !DILocation(line: 1071, column: 27, scope: !907)
!912 = !DILocation(line: 1070, column: 6, scope: !798)
!913 = !DILocation(line: 1072, column: 11, scope: !907)
!914 = !DILocation(line: 1072, column: 3, scope: !907)
!915 = !DILocation(line: 1075, column: 17, scope: !798)
!916 = !DILocation(line: 1075, column: 2, scope: !798)
!917 = !DILocation(line: 1077, column: 20, scope: !918)
!918 = distinct !DILexicalBlock(scope: !798, file: !2, line: 1075, column: 32)
!919 = !DILocation(line: 1078, column: 3, scope: !918)
!920 = !DILocation(line: 1080, column: 20, scope: !918)
!921 = !DILocation(line: 1081, column: 3, scope: !918)
!922 = !DILocation(line: 1083, column: 20, scope: !918)
!923 = !DILocation(line: 1084, column: 3, scope: !918)
!924 = !DILocation(line: 1087, column: 10, scope: !798)
!925 = !DILocation(line: 1088, column: 31, scope: !798)
!926 = !DILocation(line: 1088, column: 3, scope: !798)
!927 = !DILocation(line: 1089, column: 3, scope: !798)
!928 = !DILocation(line: 1089, column: 45, scope: !798)
!929 = !DILocation(line: 1089, column: 38, scope: !798)
!930 = !DILocation(line: 1087, column: 2, scope: !798)
!931 = !DILocation(line: 1091, column: 8, scope: !798)
!932 = !DILocation(line: 1091, column: 6, scope: !798)
!933 = !DILocation(line: 1092, column: 6, scope: !934)
!934 = distinct !DILexicalBlock(scope: !798, file: !2, line: 1092, column: 6)
!935 = !DILocation(line: 1092, column: 6, scope: !798)
!936 = !DILocation(line: 1093, column: 11, scope: !937)
!937 = distinct !DILexicalBlock(scope: !934, file: !2, line: 1092, column: 11)
!938 = !DILocation(line: 1095, column: 11, scope: !937)
!939 = !DILocation(line: 1093, column: 3, scope: !937)
!940 = !DILocation(line: 1096, column: 3, scope: !937)
!941 = !DILocation(line: 1099, column: 38, scope: !798)
!942 = !DILocation(line: 1099, column: 8, scope: !798)
!943 = !DILocation(line: 1099, column: 6, scope: !798)
!944 = !DILocation(line: 1100, column: 6, scope: !945)
!945 = distinct !DILexicalBlock(scope: !798, file: !2, line: 1100, column: 6)
!946 = !DILocation(line: 1100, column: 6, scope: !798)
!947 = !DILocation(line: 1101, column: 11, scope: !948)
!948 = distinct !DILexicalBlock(scope: !945, file: !2, line: 1100, column: 11)
!949 = !DILocation(line: 1102, column: 24, scope: !948)
!950 = !DILocation(line: 1102, column: 4, scope: !948)
!951 = !DILocation(line: 1101, column: 3, scope: !948)
!952 = !DILocation(line: 1103, column: 3, scope: !948)
!953 = !DILocation(line: 1107, column: 7, scope: !798)
!954 = !DILocation(line: 1107, column: 5, scope: !798)
!955 = !DILocation(line: 1111, column: 25, scope: !798)
!956 = !DILocation(line: 1111, column: 8, scope: !798)
!957 = !DILocation(line: 1111, column: 6, scope: !798)
!958 = !DILocation(line: 1112, column: 6, scope: !959)
!959 = distinct !DILexicalBlock(scope: !798, file: !2, line: 1112, column: 6)
!960 = !DILocation(line: 1112, column: 6, scope: !798)
!961 = !DILocation(line: 1113, column: 11, scope: !962)
!962 = distinct !DILexicalBlock(scope: !959, file: !2, line: 1112, column: 11)
!963 = !DILocation(line: 1114, column: 11, scope: !962)
!964 = !DILocation(line: 1114, column: 42, scope: !962)
!965 = !DILocation(line: 1114, column: 22, scope: !962)
!966 = !DILocation(line: 1113, column: 3, scope: !962)
!967 = !DILocation(line: 1115, column: 3, scope: !962)
!968 = !DILocation(line: 1119, column: 2, scope: !798)
!969 = !DILocation(line: 1120, column: 2, scope: !798)
!970 = !DILocation(line: 1123, column: 2, scope: !798)
!971 = !DILocation(line: 1123, column: 9, scope: !798)
!972 = !DILocation(line: 1124, column: 32, scope: !973)
!973 = distinct !DILexicalBlock(scope: !974, file: !2, line: 1124, column: 7)
!974 = distinct !DILexicalBlock(scope: !798, file: !2, line: 1123, column: 23)
!975 = !DILocation(line: 1124, column: 14, scope: !973)
!976 = !DILocation(line: 1124, column: 12, scope: !973)
!977 = !DILocation(line: 1124, column: 59, scope: !973)
!978 = !DILocation(line: 1124, column: 7, scope: !974)
!979 = !DILocation(line: 1125, column: 8, scope: !980)
!980 = distinct !DILexicalBlock(scope: !981, file: !2, line: 1125, column: 8)
!981 = distinct !DILexicalBlock(scope: !973, file: !2, line: 1124, column: 64)
!982 = !DILocation(line: 1125, column: 8, scope: !981)
!983 = !DILocation(line: 1126, column: 13, scope: !980)
!984 = !DILocation(line: 1128, column: 27, scope: !980)
!985 = !DILocation(line: 1128, column: 26, scope: !980)
!986 = !DILocation(line: 1128, column: 6, scope: !980)
!987 = !DILocation(line: 1126, column: 5, scope: !980)
!988 = !DILocation(line: 1129, column: 4, scope: !981)
!989 = distinct !{!989, !970, !990, !991}
!990 = !DILocation(line: 1131, column: 2, scope: !798)
!991 = !{!"llvm.loop.mustprogress"}
!992 = !DILocation(line: 1134, column: 13, scope: !993)
!993 = distinct !DILexicalBlock(scope: !798, file: !2, line: 1134, column: 6)
!994 = !DILocation(line: 1134, column: 27, scope: !993)
!995 = !DILocation(line: 1134, column: 48, scope: !993)
!996 = !DILocation(line: 1134, column: 51, scope: !993)
!997 = !DILocation(line: 1134, column: 6, scope: !798)
!998 = !DILocation(line: 1135, column: 19, scope: !999)
!999 = distinct !DILexicalBlock(scope: !993, file: !2, line: 1134, column: 61)
!1000 = !DILocation(line: 1135, column: 3, scope: !999)
!1001 = !DILocation(line: 1136, column: 3, scope: !999)
!1002 = !DILocation(line: 1137, column: 2, scope: !999)
!1003 = !DILocation(line: 1139, column: 20, scope: !798)
!1004 = !DILocation(line: 1139, column: 2, scope: !798)
!1005 = !DILocation(line: 1141, column: 1, scope: !798)
!1006 = !DILocation(line: 1142, column: 20, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !798, file: !2, line: 1142, column: 6)
!1008 = !DILocation(line: 1142, column: 6, scope: !1007)
!1009 = !DILocation(line: 1142, column: 55, scope: !1007)
!1010 = !DILocation(line: 1142, column: 6, scope: !798)
!1011 = !DILocation(line: 1143, column: 34, scope: !1007)
!1012 = !DILocation(line: 1143, column: 50, scope: !1007)
!1013 = !DILocation(line: 1144, column: 13, scope: !1007)
!1014 = !DILocation(line: 1143, column: 16, scope: !1007)
!1015 = !DILocation(line: 1143, column: 14, scope: !1007)
!1016 = !DILocation(line: 1143, column: 3, scope: !1007)
!1017 = !DILocation(line: 1146, column: 33, scope: !1007)
!1018 = !DILocation(line: 1147, column: 20, scope: !1007)
!1019 = !DILocation(line: 1146, column: 16, scope: !1007)
!1020 = !DILocation(line: 1146, column: 14, scope: !1007)
!1021 = !DILocation(line: 1148, column: 6, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !798, file: !2, line: 1148, column: 6)
!1023 = !DILocation(line: 1148, column: 6, scope: !798)
!1024 = !DILocation(line: 1149, column: 11, scope: !1022)
!1025 = !DILocation(line: 1151, column: 11, scope: !1022)
!1026 = !DILocation(line: 1151, column: 4, scope: !1022)
!1027 = !DILocation(line: 1151, column: 39, scope: !1022)
!1028 = !DILocation(line: 1151, column: 19, scope: !1022)
!1029 = !DILocation(line: 1149, column: 3, scope: !1022)
!1030 = !DILocation(line: 1154, column: 20, scope: !798)
!1031 = !DILocation(line: 1154, column: 52, scope: !798)
!1032 = !DILocation(line: 1155, column: 13, scope: !798)
!1033 = !DILocation(line: 1155, column: 19, scope: !798)
!1034 = !DILocation(line: 1155, column: 29, scope: !798)
!1035 = !DILocation(line: 0, scope: !798)
!1036 = !DILocation(line: 1154, column: 3, scope: !798)
!1037 = !DILocation(line: 1153, column: 13, scope: !798)
!1038 = !DILocation(line: 1156, column: 6, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !798, file: !2, line: 1156, column: 6)
!1040 = !DILocation(line: 1156, column: 6, scope: !798)
!1041 = !DILocation(line: 1157, column: 11, scope: !1039)
!1042 = !DILocation(line: 1159, column: 11, scope: !1039)
!1043 = !DILocation(line: 1159, column: 4, scope: !1039)
!1044 = !DILocation(line: 1159, column: 39, scope: !1039)
!1045 = !DILocation(line: 1159, column: 19, scope: !1039)
!1046 = !DILocation(line: 1157, column: 3, scope: !1039)
!1047 = !DILocation(line: 1161, column: 10, scope: !798)
!1048 = !DILocation(line: 1161, column: 14, scope: !798)
!1049 = !DILocation(line: 1161, column: 19, scope: !798)
!1050 = !DILocation(line: 1161, column: 22, scope: !798)
!1051 = !DILocation(line: 1161, column: 36, scope: !798)
!1052 = !DILocation(line: 1161, column: 39, scope: !798)
!1053 = !DILocation(line: 1161, column: 50, scope: !798)
!1054 = !DILocation(line: 1161, column: 2, scope: !798)
!1055 = !DILocation(line: 1162, column: 1, scope: !798)
!1056 = !DISubprogram(name: "geteuid", scope: !1057, file: !1057, line: 700, type: !1058, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !760)
!1057 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!1060}
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !139, line: 146, baseType: !39)
!1061 = !DISubprogram(name: "printf", scope: !304, file: !304, line: 356, type: !1062, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1064)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!312, !379, null}
!1064 = !{!1065}
!1065 = !DILocalVariable(name: "__format", arg: 1, scope: !1061, file: !304, line: 356, type: !379)
!1066 = distinct !DISubprogram(name: "set_rlimit", scope: !2, file: !2, line: 313, type: !1067, scopeLine: 314, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !1069)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!312, !334}
!1069 = !{!1070, !1071}
!1070 = !DILocalVariable(name: "lim", arg: 1, scope: !1066, file: !2, line: 313, type: !334)
!1071 = !DILocalVariable(name: "rlim", scope: !1066, file: !2, line: 315, type: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rlimit", file: !76, line: 139, size: 128, elements: !1073)
!1073 = !{!1074, !1076}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_cur", scope: !1072, file: !76, line: 142, baseType: !1075, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlim_t", file: !76, line: 131, baseType: !138)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_max", scope: !1072, file: !76, line: 144, baseType: !1075, size: 64, offset: 64)
!1077 = !DILocation(line: 313, column: 32, scope: !1066)
!1078 = !DILocation(line: 315, column: 2, scope: !1066)
!1079 = !DILocation(line: 315, column: 16, scope: !1066)
!1080 = !DILocation(line: 315, column: 23, scope: !1066)
!1081 = !DILocation(line: 316, column: 15, scope: !1066)
!1082 = !{!1083, !758, i64 0}
!1083 = !{!"rlimit", !758, i64 0, !758, i64 8}
!1084 = !DILocation(line: 317, column: 15, scope: !1066)
!1085 = !{!1083, !758, i64 8}
!1086 = !DILocation(line: 320, column: 10, scope: !1066)
!1087 = !DILocation(line: 320, column: 9, scope: !1066)
!1088 = !DILocation(line: 320, column: 50, scope: !1066)
!1089 = !DILocation(line: 320, column: 49, scope: !1066)
!1090 = !DILocation(line: 321, column: 1, scope: !1066)
!1091 = !DILocation(line: 320, column: 2, scope: !1066)
!1092 = !DISubprogram(name: "fprintf", scope: !304, file: !304, line: 350, type: !1093, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1095)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!312, !305, !379, null}
!1095 = !{!1096, !1097}
!1096 = !DILocalVariable(name: "__stream", arg: 1, scope: !1092, file: !304, line: 350, type: !305)
!1097 = !DILocalVariable(name: "__format", arg: 2, scope: !1092, file: !304, line: 350, type: !379)
!1098 = !DILocation(line: 143, column: 44, scope: !376)
!1099 = !DILocation(line: 146, column: 18, scope: !376)
!1100 = !DILocation(line: 146, column: 2, scope: !376)
!1101 = !DILocation(line: 147, column: 2, scope: !376)
!1102 = distinct !DISubprogram(name: "parse_arguments", scope: !2, file: !2, line: 167, type: !1103, scopeLine: 168, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !1105)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!312, !312, !801, !699}
!1105 = !{!1106, !1107, !1108, !1109, !1110, !1111, !1113, !1114}
!1106 = !DILocalVariable(name: "argc", arg: 1, scope: !1102, file: !2, line: 167, type: !312)
!1107 = !DILocalVariable(name: "argv", arg: 2, scope: !1102, file: !2, line: 167, type: !801)
!1108 = !DILocalVariable(name: "config", arg: 3, scope: !1102, file: !2, line: 167, type: !699)
!1109 = !DILocalVariable(name: "err", scope: !1102, file: !2, line: 169, type: !312)
!1110 = !DILocalVariable(name: "opt", scope: !1102, file: !2, line: 169, type: !312)
!1111 = !DILocalVariable(name: "rate_limit_ms", scope: !1102, file: !2, line: 170, type: !1112)
!1112 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1113 = !DILocalVariable(name: "cleanup_interval_s", scope: !1102, file: !2, line: 170, type: !1112)
!1114 = !DILocalVariable(name: "rtt_rate", scope: !1102, file: !2, line: 170, type: !1112)
!1115 = !DILocation(line: 167, column: 32, scope: !1102)
!1116 = !DILocation(line: 167, column: 44, scope: !1102)
!1117 = !DILocation(line: 167, column: 73, scope: !1102)
!1118 = !DILocation(line: 169, column: 2, scope: !1102)
!1119 = !DILocation(line: 169, column: 6, scope: !1102)
!1120 = !DILocation(line: 169, column: 11, scope: !1102)
!1121 = !DILocation(line: 170, column: 2, scope: !1102)
!1122 = !DILocation(line: 170, column: 9, scope: !1102)
!1123 = !DILocation(line: 170, column: 24, scope: !1102)
!1124 = !DILocation(line: 170, column: 44, scope: !1102)
!1125 = !DILocation(line: 172, column: 2, scope: !1102)
!1126 = !DILocation(line: 172, column: 10, scope: !1102)
!1127 = !DILocation(line: 172, column: 18, scope: !1102)
!1128 = !DILocation(line: 173, column: 2, scope: !1102)
!1129 = !DILocation(line: 173, column: 10, scope: !1102)
!1130 = !DILocation(line: 173, column: 21, scope: !1102)
!1131 = !DILocation(line: 173, column: 31, scope: !1102)
!1132 = !{!752, !755, i64 19}
!1133 = !DILocation(line: 174, column: 2, scope: !1102)
!1134 = !DILocation(line: 174, column: 10, scope: !1102)
!1135 = !DILocation(line: 174, column: 16, scope: !1102)
!1136 = !DILocation(line: 175, column: 2, scope: !1102)
!1137 = !DILocation(line: 175, column: 10, scope: !1102)
!1138 = !DILocation(line: 175, column: 21, scope: !1102)
!1139 = !DILocation(line: 175, column: 31, scope: !1102)
!1140 = !DILocation(line: 176, column: 2, scope: !1102)
!1141 = !DILocation(line: 176, column: 10, scope: !1102)
!1142 = !DILocation(line: 176, column: 21, scope: !1102)
!1143 = !DILocation(line: 176, column: 32, scope: !1102)
!1144 = !DILocation(line: 178, column: 2, scope: !1102)
!1145 = !DILocation(line: 178, column: 28, scope: !1102)
!1146 = !DILocation(line: 178, column: 34, scope: !1102)
!1147 = !DILocation(line: 178, column: 16, scope: !1102)
!1148 = !DILocation(line: 178, column: 14, scope: !1102)
!1149 = !DILocation(line: 179, column: 14, scope: !1102)
!1150 = !DILocation(line: 180, column: 11, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1102, file: !2, line: 179, column: 21)
!1152 = !DILocation(line: 180, column: 3, scope: !1151)
!1153 = !DILocation(line: 182, column: 15, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1155, file: !2, line: 182, column: 8)
!1155 = distinct !DILexicalBlock(scope: !1151, file: !2, line: 180, column: 16)
!1156 = !DILocation(line: 182, column: 8, scope: !1154)
!1157 = !DILocation(line: 182, column: 23, scope: !1154)
!1158 = !DILocation(line: 182, column: 8, scope: !1155)
!1159 = !DILocation(line: 183, column: 13, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1154, file: !2, line: 182, column: 38)
!1161 = !DILocation(line: 183, column: 5, scope: !1160)
!1162 = !DILocation(line: 184, column: 5, scope: !1160)
!1163 = !DILocation(line: 186, column: 12, scope: !1155)
!1164 = !DILocation(line: 186, column: 20, scope: !1155)
!1165 = !DILocation(line: 186, column: 28, scope: !1155)
!1166 = !DILocation(line: 186, column: 4, scope: !1155)
!1167 = !DILocation(line: 188, column: 37, scope: !1155)
!1168 = !DILocation(line: 188, column: 45, scope: !1155)
!1169 = !DILocation(line: 188, column: 22, scope: !1155)
!1170 = !DILocation(line: 188, column: 4, scope: !1155)
!1171 = !DILocation(line: 188, column: 12, scope: !1155)
!1172 = !DILocation(line: 188, column: 20, scope: !1155)
!1173 = !DILocation(line: 189, column: 8, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1155, file: !2, line: 189, column: 8)
!1175 = !DILocation(line: 189, column: 16, scope: !1174)
!1176 = !DILocation(line: 189, column: 24, scope: !1174)
!1177 = !DILocation(line: 189, column: 8, scope: !1155)
!1178 = !DILocation(line: 190, column: 12, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1174, file: !2, line: 189, column: 30)
!1180 = !DILocation(line: 190, column: 11, scope: !1179)
!1181 = !DILocation(line: 190, column: 9, scope: !1179)
!1182 = !DILocation(line: 191, column: 13, scope: !1179)
!1183 = !DILocation(line: 193, column: 6, scope: !1179)
!1184 = !DILocation(line: 193, column: 14, scope: !1179)
!1185 = !DILocation(line: 193, column: 42, scope: !1179)
!1186 = !DILocation(line: 193, column: 22, scope: !1179)
!1187 = !DILocation(line: 191, column: 5, scope: !1179)
!1188 = !DILocation(line: 194, column: 12, scope: !1179)
!1189 = !DILocation(line: 194, column: 5, scope: !1179)
!1190 = !DILocation(line: 196, column: 4, scope: !1155)
!1191 = !DILocation(line: 198, column: 47, scope: !1155)
!1192 = !DILocation(line: 198, column: 10, scope: !1155)
!1193 = !DILocation(line: 198, column: 8, scope: !1155)
!1194 = !DILocation(line: 201, column: 8, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1155, file: !2, line: 201, column: 8)
!1196 = !DILocation(line: 201, column: 8, scope: !1155)
!1197 = !DILocation(line: 202, column: 5, scope: !1195)
!1198 = !DILocation(line: 205, column: 5, scope: !1155)
!1199 = !{!1200, !1200, i64 0}
!1200 = !{!"double", !743, i64 0}
!1201 = !DILocation(line: 205, column: 19, scope: !1155)
!1202 = !DILocation(line: 204, column: 4, scope: !1155)
!1203 = !DILocation(line: 204, column: 12, scope: !1155)
!1204 = !DILocation(line: 204, column: 23, scope: !1155)
!1205 = !DILocation(line: 204, column: 34, scope: !1155)
!1206 = !{!752, !754, i64 0}
!1207 = !DILocation(line: 206, column: 4, scope: !1155)
!1208 = !DILocation(line: 208, column: 42, scope: !1155)
!1209 = !DILocation(line: 208, column: 10, scope: !1155)
!1210 = !DILocation(line: 208, column: 8, scope: !1155)
!1211 = !DILocation(line: 210, column: 8, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1155, file: !2, line: 210, column: 8)
!1213 = !DILocation(line: 210, column: 8, scope: !1155)
!1214 = !DILocation(line: 211, column: 5, scope: !1212)
!1215 = !DILocation(line: 213, column: 5, scope: !1155)
!1216 = !DILocation(line: 212, column: 4, scope: !1155)
!1217 = !DILocation(line: 212, column: 12, scope: !1155)
!1218 = !DILocation(line: 212, column: 23, scope: !1155)
!1219 = !DILocation(line: 212, column: 32, scope: !1155)
!1220 = !{!752, !754, i64 8}
!1221 = !DILocation(line: 214, column: 4, scope: !1155)
!1222 = !DILocation(line: 216, column: 15, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1155, file: !2, line: 216, column: 8)
!1224 = !DILocation(line: 216, column: 8, scope: !1223)
!1225 = !DILocation(line: 216, column: 30, scope: !1223)
!1226 = !DILocation(line: 216, column: 8, scope: !1155)
!1227 = !DILocation(line: 217, column: 5, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1223, file: !2, line: 216, column: 36)
!1229 = !DILocation(line: 217, column: 13, scope: !1228)
!1230 = !DILocation(line: 217, column: 24, scope: !1228)
!1231 = !DILocation(line: 217, column: 33, scope: !1228)
!1232 = !{!752, !755, i64 16}
!1233 = !DILocation(line: 218, column: 4, scope: !1228)
!1234 = !DILocation(line: 219, column: 20, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1223, file: !2, line: 219, column: 13)
!1236 = !DILocation(line: 219, column: 13, scope: !1235)
!1237 = !DILocation(line: 219, column: 40, scope: !1235)
!1238 = !DILocation(line: 219, column: 13, scope: !1223)
!1239 = !DILocation(line: 220, column: 5, scope: !1240)
!1240 = distinct !DILexicalBlock(scope: !1235, file: !2, line: 219, column: 46)
!1241 = !DILocation(line: 220, column: 13, scope: !1240)
!1242 = !DILocation(line: 220, column: 24, scope: !1240)
!1243 = !DILocation(line: 220, column: 33, scope: !1240)
!1244 = !DILocation(line: 221, column: 4, scope: !1240)
!1245 = !DILocation(line: 222, column: 13, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1235, file: !2, line: 221, column: 11)
!1247 = !DILocation(line: 222, column: 5, scope: !1246)
!1248 = !DILocation(line: 224, column: 5, scope: !1246)
!1249 = !DILocation(line: 226, column: 4, scope: !1155)
!1250 = !DILocation(line: 228, column: 52, scope: !1155)
!1251 = !DILocation(line: 228, column: 10, scope: !1155)
!1252 = !DILocation(line: 228, column: 8, scope: !1155)
!1253 = !DILocation(line: 231, column: 8, scope: !1254)
!1254 = distinct !DILexicalBlock(scope: !1155, file: !2, line: 231, column: 8)
!1255 = !DILocation(line: 231, column: 8, scope: !1155)
!1256 = !DILocation(line: 232, column: 5, scope: !1254)
!1257 = !DILocation(line: 235, column: 5, scope: !1155)
!1258 = !DILocation(line: 235, column: 24, scope: !1155)
!1259 = !DILocation(line: 234, column: 4, scope: !1155)
!1260 = !DILocation(line: 234, column: 12, scope: !1155)
!1261 = !DILocation(line: 234, column: 29, scope: !1155)
!1262 = !DILocation(line: 236, column: 4, scope: !1155)
!1263 = !DILocation(line: 238, column: 15, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1155, file: !2, line: 238, column: 8)
!1265 = !DILocation(line: 238, column: 8, scope: !1264)
!1266 = !DILocation(line: 238, column: 35, scope: !1264)
!1267 = !DILocation(line: 238, column: 8, scope: !1155)
!1268 = !DILocation(line: 239, column: 5, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1264, file: !2, line: 238, column: 41)
!1270 = !DILocation(line: 239, column: 13, scope: !1269)
!1271 = !DILocation(line: 239, column: 27, scope: !1269)
!1272 = !DILocation(line: 240, column: 4, scope: !1269)
!1273 = !DILocation(line: 240, column: 22, scope: !1274)
!1274 = distinct !DILexicalBlock(scope: !1264, file: !2, line: 240, column: 15)
!1275 = !DILocation(line: 240, column: 15, scope: !1274)
!1276 = !DILocation(line: 240, column: 38, scope: !1274)
!1277 = !DILocation(line: 240, column: 15, scope: !1264)
!1278 = !DILocation(line: 241, column: 5, scope: !1279)
!1279 = distinct !DILexicalBlock(scope: !1274, file: !2, line: 240, column: 44)
!1280 = !DILocation(line: 241, column: 13, scope: !1279)
!1281 = !DILocation(line: 241, column: 27, scope: !1279)
!1282 = !DILocation(line: 242, column: 4, scope: !1279)
!1283 = !DILocation(line: 242, column: 22, scope: !1284)
!1284 = distinct !DILexicalBlock(scope: !1274, file: !2, line: 242, column: 15)
!1285 = !DILocation(line: 242, column: 15, scope: !1284)
!1286 = !DILocation(line: 242, column: 39, scope: !1284)
!1287 = !DILocation(line: 242, column: 15, scope: !1274)
!1288 = !DILocation(line: 243, column: 5, scope: !1289)
!1289 = distinct !DILexicalBlock(scope: !1284, file: !2, line: 242, column: 45)
!1290 = !DILocation(line: 243, column: 13, scope: !1289)
!1291 = !DILocation(line: 243, column: 27, scope: !1289)
!1292 = !DILocation(line: 244, column: 4, scope: !1289)
!1293 = !DILocation(line: 245, column: 13, scope: !1294)
!1294 = distinct !DILexicalBlock(scope: !1284, file: !2, line: 244, column: 11)
!1295 = !DILocation(line: 245, column: 5, scope: !1294)
!1296 = !DILocation(line: 246, column: 5, scope: !1294)
!1297 = !DILocation(line: 248, column: 4, scope: !1155)
!1298 = !DILocation(line: 250, column: 15, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1155, file: !2, line: 250, column: 8)
!1300 = !DILocation(line: 250, column: 8, scope: !1299)
!1301 = !DILocation(line: 250, column: 30, scope: !1299)
!1302 = !DILocation(line: 250, column: 8, scope: !1155)
!1303 = !DILocation(line: 251, column: 5, scope: !1304)
!1304 = distinct !DILexicalBlock(scope: !1299, file: !2, line: 250, column: 36)
!1305 = !DILocation(line: 251, column: 13, scope: !1304)
!1306 = !DILocation(line: 251, column: 26, scope: !1304)
!1307 = !DILocation(line: 252, column: 4, scope: !1304)
!1308 = !DILocation(line: 252, column: 22, scope: !1309)
!1309 = distinct !DILexicalBlock(scope: !1299, file: !2, line: 252, column: 15)
!1310 = !DILocation(line: 252, column: 15, scope: !1309)
!1311 = !DILocation(line: 252, column: 36, scope: !1309)
!1312 = !DILocation(line: 252, column: 15, scope: !1299)
!1313 = !DILocation(line: 253, column: 5, scope: !1314)
!1314 = distinct !DILexicalBlock(scope: !1309, file: !2, line: 252, column: 42)
!1315 = !DILocation(line: 253, column: 13, scope: !1314)
!1316 = !DILocation(line: 253, column: 26, scope: !1314)
!1317 = !DILocation(line: 254, column: 4, scope: !1314)
!1318 = !DILocation(line: 255, column: 13, scope: !1319)
!1319 = distinct !DILexicalBlock(scope: !1309, file: !2, line: 254, column: 11)
!1320 = !DILocation(line: 255, column: 5, scope: !1319)
!1321 = !DILocation(line: 256, column: 5, scope: !1319)
!1322 = !DILocation(line: 258, column: 4, scope: !1155)
!1323 = !DILocation(line: 260, column: 4, scope: !1155)
!1324 = !DILocation(line: 260, column: 12, scope: !1155)
!1325 = !DILocation(line: 260, column: 23, scope: !1155)
!1326 = !DILocation(line: 260, column: 33, scope: !1155)
!1327 = !DILocation(line: 261, column: 4, scope: !1155)
!1328 = !DILocation(line: 263, column: 4, scope: !1155)
!1329 = !DILocation(line: 263, column: 12, scope: !1155)
!1330 = !DILocation(line: 263, column: 18, scope: !1155)
!1331 = !DILocation(line: 264, column: 4, scope: !1155)
!1332 = !DILocation(line: 264, column: 12, scope: !1155)
!1333 = !DILocation(line: 264, column: 22, scope: !1155)
!1334 = !DILocation(line: 265, column: 4, scope: !1155)
!1335 = !DILocation(line: 267, column: 4, scope: !1155)
!1336 = !DILocation(line: 267, column: 12, scope: !1155)
!1337 = !DILocation(line: 267, column: 23, scope: !1155)
!1338 = !DILocation(line: 267, column: 33, scope: !1155)
!1339 = !DILocation(line: 268, column: 4, scope: !1155)
!1340 = !DILocation(line: 270, column: 4, scope: !1155)
!1341 = !DILocation(line: 270, column: 12, scope: !1155)
!1342 = !DILocation(line: 270, column: 23, scope: !1155)
!1343 = !DILocation(line: 270, column: 34, scope: !1155)
!1344 = !DILocation(line: 271, column: 4, scope: !1155)
!1345 = !DILocation(line: 273, column: 4, scope: !1155)
!1346 = !DILocation(line: 274, column: 16, scope: !1155)
!1347 = !DILocation(line: 274, column: 4, scope: !1155)
!1348 = !DILocation(line: 275, column: 4, scope: !1155)
!1349 = !DILocation(line: 277, column: 12, scope: !1155)
!1350 = !DILocation(line: 277, column: 43, scope: !1155)
!1351 = !DILocation(line: 277, column: 48, scope: !1155)
!1352 = !DILocation(line: 277, column: 4, scope: !1155)
!1353 = !DILocation(line: 278, column: 4, scope: !1155)
!1354 = distinct !{!1354, !1144, !1355, !991}
!1355 = !DILocation(line: 280, column: 2, scope: !1102)
!1356 = !DILocation(line: 282, column: 6, scope: !1357)
!1357 = distinct !DILexicalBlock(scope: !1102, file: !2, line: 282, column: 6)
!1358 = !DILocation(line: 282, column: 14, scope: !1357)
!1359 = !DILocation(line: 282, column: 22, scope: !1357)
!1360 = !DILocation(line: 282, column: 6, scope: !1102)
!1361 = !DILocation(line: 283, column: 11, scope: !1362)
!1362 = distinct !DILexicalBlock(scope: !1357, file: !2, line: 282, column: 28)
!1363 = !DILocation(line: 283, column: 3, scope: !1362)
!1364 = !DILocation(line: 285, column: 3, scope: !1362)
!1365 = !DILocation(line: 288, column: 2, scope: !1102)
!1366 = !DILocation(line: 289, column: 1, scope: !1102)
!1367 = distinct !DISubprogram(name: "print_usage", scope: !2, file: !2, line: 115, type: !1368, scopeLine: 116, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !1370)
!1368 = !DISubroutineType(types: !1369)
!1369 = !{null, !801}
!1370 = !{!1371, !1372}
!1371 = !DILocalVariable(name: "argv", arg: 1, scope: !1367, file: !2, line: 115, type: !801)
!1372 = !DILocalVariable(name: "i", scope: !1367, file: !2, line: 117, type: !312)
!1373 = !DILocation(line: 115, column: 31, scope: !1367)
!1374 = !DILocation(line: 117, column: 2, scope: !1367)
!1375 = !DILocation(line: 117, column: 6, scope: !1367)
!1376 = !DILocation(line: 119, column: 35, scope: !1367)
!1377 = !DILocation(line: 119, column: 2, scope: !1367)
!1378 = !DILocation(line: 120, column: 2, scope: !1367)
!1379 = !DILocation(line: 121, column: 45, scope: !1367)
!1380 = !DILocation(line: 121, column: 2, scope: !1367)
!1381 = !DILocation(line: 122, column: 2, scope: !1367)
!1382 = !DILocation(line: 123, column: 9, scope: !1383)
!1383 = distinct !DILexicalBlock(scope: !1367, file: !2, line: 123, column: 2)
!1384 = !DILocation(line: 123, column: 7, scope: !1383)
!1385 = !DILocation(line: 123, column: 27, scope: !1386)
!1386 = distinct !DILexicalBlock(scope: !1383, file: !2, line: 123, column: 2)
!1387 = !DILocation(line: 123, column: 14, scope: !1386)
!1388 = !DILocation(line: 123, column: 30, scope: !1386)
!1389 = !{!1390, !742, i64 0}
!1390 = !{!"option", !742, i64 0, !756, i64 8, !742, i64 16, !756, i64 24}
!1391 = !DILocation(line: 123, column: 35, scope: !1386)
!1392 = !DILocation(line: 123, column: 2, scope: !1383)
!1393 = !DILocation(line: 124, column: 35, scope: !1394)
!1394 = distinct !DILexicalBlock(scope: !1386, file: !2, line: 123, column: 46)
!1395 = !DILocation(line: 124, column: 22, scope: !1394)
!1396 = !DILocation(line: 124, column: 38, scope: !1394)
!1397 = !DILocation(line: 124, column: 3, scope: !1394)
!1398 = !DILocation(line: 125, column: 20, scope: !1399)
!1399 = distinct !DILexicalBlock(scope: !1394, file: !2, line: 125, column: 7)
!1400 = !DILocation(line: 125, column: 7, scope: !1399)
!1401 = !DILocation(line: 125, column: 23, scope: !1399)
!1402 = !{!1390, !742, i64 16}
!1403 = !DILocation(line: 125, column: 28, scope: !1399)
!1404 = !DILocation(line: 125, column: 7, scope: !1394)
!1405 = !DILocation(line: 127, column: 25, scope: !1399)
!1406 = !DILocation(line: 127, column: 12, scope: !1399)
!1407 = !DILocation(line: 127, column: 28, scope: !1399)
