; ModuleID = '/home/demo/fontconfig-shared/test/test-pthread.c'
source_filename = "/home/demo/fontconfig-shared/test/test-pthread.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.thr_arg_s = type { i32 }

@.str = private unnamed_addr constant [21 x i8] c"Creating %d threads\0A\00", align 1, !dbg !0
@stderr = external global ptr, align 8
@.str.1 = private unnamed_addr constant [25 x i8] c"Cannot create thread %d\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [18 x i8] c"Joined thread %d\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [17 x i8] c"Thread %d: done\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [23 x i8] c"New Century Schoolbook\00", align 1, !dbg !22

; Function Attrs: nounwind uwtable
define dso_local i32 @main(i32 noundef %0, ptr noundef %1) #0 !dbg !65 {
  %3 = alloca i32, align 4
  %4 = alloca i32, align 4
  %5 = alloca ptr, align 8
  %6 = alloca [100 x i64], align 16
  %7 = alloca i32, align 4
  %8 = alloca i32, align 4
  %9 = alloca %struct.thr_arg_s, align 4
  %10 = alloca i32, align 4
  %11 = alloca i32, align 4
  store i32 0, ptr %3, align 4
  store i32 %0, ptr %4, align 4, !tbaa !87
  call void @llvm.dbg.declare(metadata ptr %4, metadata !71, metadata !DIExpression()), !dbg !91
  store ptr %1, ptr %5, align 8, !tbaa !92

!151 = !DILocation(line: 97, column: 3, scope: !145)
!152 = !DILocation(line: 98, column: 2, scope: !145)
!153 = !DILocation(line: 94, column: 15, scope: !140)
!154 = !DILocation(line: 94, column: 2, scope: !140)
!155 = distinct !{!155, !143, !156, !134, !135}
!156 = !DILocation(line: 98, column: 2, scope: !137)
!157 = !DILocation(line: 100, column: 2, scope: !65)
!158 = !DILocation(line: 102, column: 2, scope: !65)
!159 = !DILocation(line: 103, column: 1, scope: !65)
!160 = !DISubprogram(name: "printf", scope: !161, file: !161, line: 356, type: !162, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !167)
!161 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!162 = !DISubroutineType(types: !163)
!163 = !{!52, !164, null}
!164 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!167 = !{}
!168 = !DISubprogram(name: "pthread_create", scope: !169, file: !169, line: 202, type: !170, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !167)
!169 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "5205981c6f80cc3dc1e81231df63d8ef")
!170 = !DISubroutineType(types: !171)
!171 = !{!52, !172, !174, !186, !189}
!172 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_attr_t", file: !76, line: 62, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "pthread_attr_t", file: !76, line: 56, size: 448, elements: !179)
!179 = !{!180, !184}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !178, file: !76, line: 58, baseType: !181, size: 448)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 56)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !178, file: !76, line: 59, baseType: !185, size: 64)
!185 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!47, !47}
!189 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !47)
!190 = distinct !DISubprogram(name: "run_test_in_thread", scope: !2, file: !2, line: 60, type: !187, scopeLine: 61, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !191)
!191 = !{!192, !193, !194, !195}
!192 = !DILocalVariable(name: "arg", arg: 1, scope: !190, file: !2, line: 60, type: !47)
!193 = !DILocalVariable(name: "thr_arg", scope: !190, file: !2, line: 62, type: !48)
!194 = !DILocalVariable(name: "thread_num", scope: !190, file: !2, line: 63, type: !52)
!195 = !DILocalVariable(name: "i", scope: !190, file: !2, line: 64, type: !52)
!196 = !DILocation(line: 60, column: 39, scope: !190)
!197 = !DILocation(line: 62, column: 2, scope: !190)
!198 = !DILocation(line: 62, column: 20, scope: !190)
!199 = !DILocation(line: 62, column: 48, scope: !190)
!200 = !DILocation(line: 63, column: 2, scope: !190)
!201 = !DILocation(line: 63, column: 6, scope: !190)
!202 = !DILocation(line: 63, column: 19, scope: !190)
!203 = !DILocation(line: 63, column: 28, scope: !190)
!204 = !DILocation(line: 64, column: 2, scope: !190)
!205 = !DILocation(line: 64, column: 6, scope: !190)
!206 = !DILocation(line: 66, column: 2, scope: !190)
!207 = !DILocation(line: 66, column: 7, scope: !208)
!208 = distinct !DILexicalBlock(scope: !209, file: !2, line: 66, column: 2)
!209 = distinct !DILexicalBlock(scope: !190, file: !2, line: 66, column: 2)
!210 = !DILocation(line: 66, column: 8, scope: !208)
!211 = !DILocation(line: 66, column: 2, scope: !209)
!212 = !DILocation(line: 66, column: 31, scope: !208)
!213 = !DILocation(line: 66, column: 42, scope: !208)
!214 = !DILocation(line: 66, column: 20, scope: !208)
!215 = !DILocation(line: 66, column: 16, scope: !208)
!216 = !DILocation(line: 66, column: 2, scope: !208)
!217 = distinct !{!217, !211, !218, !134, !135}
!218 = !DILocation(line: 66, column: 43, scope: !209)
!219 = !DILocation(line: 68, column: 29, scope: !190)
!220 = !DILocation(line: 68, column: 2, scope: !190)
!221 = !DILocation(line: 71, column: 1, scope: !190)
!222 = !DILocation(line: 70, column: 2, scope: !190)
!223 = !DISubprogram(name: "fprintf", scope: !161, file: !161, line: 350, type: !224, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !167)
!224 = !DISubroutineType(types: !225)
!225 = !{!52, !226, !164, null}
!226 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !229, line: 7, baseType: !230)
!229 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !231, line: 49, size: 1728, elements: !232)
!231 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!232 = !{!233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !248, !250, !251, !252, !255, !257, !259, !263, !266, !268, !271, !274, !275, !276, !279, !280}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !230, file: !231, line: 51, baseType: !52, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !230, file: !231, line: 54, baseType: !69, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !230, file: !231, line: 55, baseType: !69, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !230, file: !231, line: 56, baseType: !69, size: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !230, file: !231, line: 57, baseType: !69, size: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !230, file: !231, line: 58, baseType: !69, size: 64, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !230, file: !231, line: 59, baseType: !69, size: 64, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !230, file: !231, line: 60, baseType: !69, size: 64, offset: 448)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !230, file: !231, line: 61, baseType: !69, size: 64, offset: 512)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !230, file: !231, line: 64, baseType: !69, size: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !230, file: !231, line: 65, baseType: !69, size: 64, offset: 640)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !230, file: !231, line: 66, baseType: !69, size: 64, offset: 704)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !230, file: !231, line: 68, baseType: !246, size: 64, offset: 768)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !231, line: 36, flags: DIFlagFwdDecl)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !230, file: !231, line: 70, baseType: !249, size: 64, offset: 832)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !230, file: !231, line: 72, baseType: !52, size: 32, offset: 896)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !230, file: !231, line: 73, baseType: !52, size: 32, offset: 928)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !230, file: !231, line: 74, baseType: !253, size: 64, offset: 960)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !254, line: 152, baseType: !185)
!254 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !230, file: !231, line: 77, baseType: !256, size: 16, offset: 1024)
!256 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !230, file: !231, line: 78, baseType: !258, size: 8, offset: 1040)
!258 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !230, file: !231, line: 79, baseType: !260, size: 8, offset: 1048)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 1)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !230, file: !231, line: 81, baseType: !264, size: 64, offset: 1088)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !231, line: 43, baseType: null)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !230, file: !231, line: 89, baseType: !267, size: 64, offset: 1152)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !254, line: 153, baseType: !185)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !230, file: !231, line: 91, baseType: !269, size: 64, offset: 1216)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !231, line: 37, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !230, file: !231, line: 92, baseType: !272, size: 64, offset: 1280)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !231, line: 38, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !230, file: !231, line: 93, baseType: !249, size: 64, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !230, file: !231, line: 94, baseType: !47, size: 64, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !230, file: !231, line: 95, baseType: !277, size: 64, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !278, line: 46, baseType: !77)
!278 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/demo", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !230, file: !231, line: 96, baseType: !52, size: 32, offset: 1536)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !230, file: !231, line: 98, baseType: !281, size: 160, offset: 1568)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 20)
!284 = !DISubprogram(name: "pthread_join", scope: !169, file: !169, line: 219, type: !285, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !167)
!285 = !DISubroutineType(types: !286)
!286 = !{!52, !75, !287}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!288 = !DISubprogram(name: "FcFini", scope: !31, file: !31, line: 645, type: !289, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !167)
!289 = !DISubroutineType(types: !290)
!290 = !{null}
!291 = distinct !DISubprogram(name: "test_match", scope: !2, file: !2, line: 41, type: !292, scopeLine: 42, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !294)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !52, !52}
!294 = !{!295, !296, !297, !301, !302}
!295 = !DILocalVariable(name: "thr_num", arg: 1, scope: !291, file: !2, line: 41, type: !52)
!296 = !DILocalVariable(name: "test_num", arg: 2, scope: !291, file: !2, line: 41, type: !52)
!297 = !DILocalVariable(name: "pat", scope: !291, file: !2, line: 43, type: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "FcPattern", file: !31, line: 249, baseType: !300)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FcPattern", file: !31, line: 249, flags: DIFlagFwdDecl)
!301 = !DILocalVariable(name: "match", scope: !291, file: !2, line: 44, type: !298)
!302 = !DILocalVariable(name: "result", scope: !291, file: !2, line: 45, type: !303)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "FcResult", file: !31, line: 241, baseType: !30)
!304 = !DILocation(line: 41, column: 28, scope: !291)
!305 = !DILocation(line: 41, column: 40, scope: !291)
!306 = !DILocation(line: 43, column: 2, scope: !291)
!307 = !DILocation(line: 43, column: 13, scope: !291)
!308 = !DILocation(line: 44, column: 2, scope: !291)
!309 = !DILocation(line: 44, column: 13, scope: !291)
!310 = !DILocation(line: 45, column: 2, scope: !291)
!311 = !DILocation(line: 45, column: 12, scope: !291)
!312 = !DILocation(line: 47, column: 2, scope: !291)
!313 = !DILocation(line: 49, column: 8, scope: !291)
!314 = !DILocation(line: 49, column: 6, scope: !291)
!315 = !DILocation(line: 51, column: 23, scope: !291)
!316 = !DILocation(line: 51, column: 2, scope: !291)
!317 = !DILocation(line: 52, column: 22, scope: !291)
!318 = !DILocation(line: 52, column: 2, scope: !291)
!319 = !DILocation(line: 54, column: 24, scope: !291)
!320 = !DILocation(line: 54, column: 10, scope: !291)
!321 = !DILocation(line: 54, column: 8, scope: !291)
!322 = !DILocation(line: 56, column: 19, scope: !291)
!323 = !DILocation(line: 56, column: 2, scope: !291)
!324 = !DILocation(line: 57, column: 19, scope: !291)
!325 = !DILocation(line: 57, column: 2, scope: !291)
!326 = !DILocation(line: 58, column: 1, scope: !291)
!327 = !DISubprogram(name: "FcInit", scope: !31, file: !31, line: 642, type: !328, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !167)
!328 = !DISubroutineType(types: !329)
!329 = !{!330}
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "FcBool", file: !31, line: 46, baseType: !52)
!331 = !DISubprogram(name: "FcNameParse", scope: !31, file: !31, line: 843, type: !332, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !167)
!332 = !DISubroutineType(types: !333)
!333 = !{!298, !53}
!334 = !DISubprogram(name: "FcConfigSubstitute", scope: !31, file: !31, line: 465, type: !335, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !167)
!335 = !DISubroutineType(types: !336)
!336 = !{!330, !337, !298, !340}
